zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/include/component/crypto.h
#define CRYPTO_DMA_PUSH_ADDR_LSB_PUSH_ADDR_LSB_Pos _UINT32_(0)                                          /* (CRYPTO_DMA_PUSH_ADDR_LSB)  Position */
#define CRYPTO_DMA_PUSH_ADDR_LSB_PUSH_ADDR_LSB_Msk (_UINT32_(0xFFFFFFFF) << CRYPTO_DMA_PUSH_ADDR_LSB_PUSH_ADDR_LSB_Pos) /* (CRYPTO_DMA_PUSH_ADDR_LSB)  Mask */
#define CRYPTO_DMA_PUSH_ADDR_LSB_PUSH_ADDR_LSB(value) (CRYPTO_DMA_PUSH_ADDR_LSB_PUSH_ADDR_LSB_Msk & (_UINT32_(value) << CRYPTO_DMA_PUSH_ADDR_LSB_PUSH_ADDR_LSB_Pos)) /* Assignment of value for PUSH_ADDR_LSB in the CRYPTO_DMA_PUSH_ADDR_LSB register */
#define CRYPTO_DMA_PUSH_ADDR_LSB_Msk          _UINT32_(0xFFFFFFFF)                                 /* (CRYPTO_DMA_PUSH_ADDR_LSB) Register Mask  */


/* -------- CRYPTO_DMA_PUSH_ADDR_MSB : (CRYPTO Offset: 0x14) (R/W 32)  -------- */
#define CRYPTO_DMA_PUSH_ADDR_MSB_RESETVALUE   _UINT32_(0x00)                                       /*  (CRYPTO_DMA_PUSH_ADDR_MSB)   Reset Value */

#define CRYPTO_DMA_PUSH_ADDR_MSB_PUSH_ADDR_MSB_Pos _UINT32_(0)                                          /* (CRYPTO_DMA_PUSH_ADDR_MSB)  Position */
#define CRYPTO_DMA_PUSH_ADDR_MSB_PUSH_ADDR_MSB_Msk (_UINT32_(0xFFFFFFFF) << CRYPTO_DMA_PUSH_ADDR_MSB_PUSH_ADDR_MSB_Pos) /* (CRYPTO_DMA_PUSH_ADDR_MSB)  Mask */
#define CRYPTO_DMA_PUSH_ADDR_MSB_PUSH_ADDR_MSB(value) (CRYPTO_DMA_PUSH_ADDR_MSB_PUSH_ADDR_MSB_Msk & (_UINT32_(value) << CRYPTO_DMA_PUSH_ADDR_MSB_PUSH_ADDR_MSB_Pos)) /* Assignment of value for PUSH_ADDR_MSB in the CRYPTO_DMA_PUSH_ADDR_MSB register */
#define CRYPTO_DMA_PUSH_ADDR_MSB_Msk          _UINT32_(0xFFFFFFFF)                                 /* (CRYPTO_DMA_PUSH_ADDR_MSB) Register Mask  */


/* -------- CRYPTO_DMA_PUSH_LEN : (CRYPTO Offset: 0x18) (R/W 32)  -------- */
#define CRYPTO_DMA_PUSH_LEN_RESETVALUE        _UINT32_(0x00)                                       /*  (CRYPTO_DMA_PUSH_LEN)   Reset Value */

#define CRYPTO_DMA_PUSH_LEN_PUSH_LEN_Pos      _UINT32_(0)                                          /* (CRYPTO_DMA_PUSH_LEN)  Position */
#define CRYPTO_DMA_PUSH_LEN_PUSH_LEN_Msk      (_UINT32_(0xFFFFFFF) << CRYPTO_DMA_PUSH_LEN_PUSH_LEN_Pos) /* (CRYPTO_DMA_PUSH_LEN)  Mask */
#define CRYPTO_DMA_PUSH_LEN_PUSH_LEN(value)   (CRYPTO_DMA_PUSH_LEN_PUSH_LEN_Msk & (_UINT32_(value) << CRYPTO_DMA_PUSH_LEN_PUSH_LEN_Pos)) /* Assignment of value for PUSH_LEN in the CRYPTO_DMA_PUSH_LEN register */
#define CRYPTO_DMA_PUSH_LEN_PUSH_CSTADDR_Pos  _UINT32_(28)                                         /* (CRYPTO_DMA_PUSH_LEN)  Position */
#define CRYPTO_DMA_PUSH_LEN_PUSH_CSTADDR_Msk  (_UINT32_(0x1) << CRYPTO_DMA_PUSH_LEN_PUSH_CSTADDR_Pos) /* (CRYPTO_DMA_PUSH_LEN)  Mask */
#define CRYPTO_DMA_PUSH_LEN_PUSH_CSTADDR(value) (CRYPTO_DMA_PUSH_LEN_PUSH_CSTADDR_Msk & (_UINT32_(value) << CRYPTO_DMA_PUSH_LEN_PUSH_CSTADDR_Pos)) /* Assignment of value for PUSH_CSTADDR in the CRYPTO_DMA_PUSH_LEN register */
#define CRYPTO_DMA_PUSH_LEN_PUSH_REALIGN_Pos  _UINT32_(29)                                         /* (CRYPTO_DMA_PUSH_LEN)  Position */
#define CRYPTO_DMA_PUSH_LEN_PUSH_REALIGN_Msk  (_UINT32_(0x1) << CRYPTO_DMA_PUSH_LEN_PUSH_REALIGN_Pos) /* (CRYPTO_DMA_PUSH_LEN)  Mask */
#define CRYPTO_DMA_PUSH_LEN_PUSH_REALIGN(value) (CRYPTO_DMA_PUSH_LEN_PUSH_REALIGN_Msk & (_UINT32_(value) << CRYPTO_DMA_PUSH_LEN_PUSH_REALIGN_Pos)) /* Assignment of value for PUSH_REALIGN in the CRYPTO_DMA_PUSH_LEN register */
#define CRYPTO_DMA_PUSH_LEN_PUSH_DISCARD_Pos  _UINT32_(30)                                         /* (CRYPTO_DMA_PUSH_LEN)  Position */
#define CRYPTO_DMA_PUSH_LEN_PUSH_DISCARD_Msk  (_UINT32_(0x1) << CRYPTO_DMA_PUSH_LEN_PUSH_DISCARD_Pos) /* (CRYPTO_DMA_PUSH_LEN)  Mask */
#define CRYPTO_DMA_PUSH_LEN_PUSH_DISCARD(value) (CRYPTO_DMA_PUSH_LEN_PUSH_DISCARD_Msk & (_UINT32_(value) << CRYPTO_DMA_PUSH_LEN_PUSH_DISCARD_Pos)) /* Assignment of value for PUSH_DISCARD in the CRYPTO_DMA_PUSH_LEN register */
#define CRYPTO_DMA_PUSH_LEN_Msk               _UINT32_(0x7FFFFFFF)                                 /* (CRYPTO_DMA_PUSH_LEN) Register Mask  */


/* -------- CRYPTO_DMA_INT_EN : (CRYPTO Offset: 0x1C) (R/W 32)  -------- */
#define CRYPTO_DMA_INT_EN_RESETVALUE          _UINT32_(0x00)                                       /*  (CRYPTO_DMA_INT_EN)   Reset Value */

#define CRYPTO_DMA_INT_EN_INT_EN_Pos          _UINT32_(0)                                          /* (CRYPTO_DMA_INT_EN)  Position */
#define CRYPTO_DMA_INT_EN_INT_EN_Msk          (_UINT32_(0xFFFFFFFF) << CRYPTO_DMA_INT_EN_INT_EN_Pos) /* (CRYPTO_DMA_INT_EN)  Mask */
#define CRYPTO_DMA_INT_EN_INT_EN(value)       (CRYPTO_DMA_INT_EN_INT_EN_Msk & (_UINT32_(value) << CRYPTO_DMA_INT_EN_INT_EN_Pos)) /* Assignment of value for INT_EN in the CRYPTO_DMA_INT_EN register */
#define CRYPTO_DMA_INT_EN_Msk                 _UINT32_(0xFFFFFFFF)                                 /* (CRYPTO_DMA_INT_EN) Register Mask  */


/* -------- CRYPTO_DMA_INT_ENSET : (CRYPTO Offset: 0x20) ( /W 32)  -------- */
#define CRYPTO_DMA_INT_ENSET_RESETVALUE       _UINT32_(0x00)                                       /*  (CRYPTO_DMA_INT_ENSET)   Reset Value */

#define CRYPTO_DMA_INT_ENSET_INT_ENSET_Pos    _UINT32_(0)                                          /* (CRYPTO_DMA_INT_ENSET)  Position */
#define CRYPTO_DMA_INT_ENSET_INT_ENSET_Msk    (_UINT32_(0xFFFFFFFF) << CRYPTO_DMA_INT_ENSET_INT_ENSET_Pos) /* (CRYPTO_DMA_INT_ENSET)  Mask */
#define CRYPTO_DMA_INT_ENSET_INT_ENSET(value) (CRYPTO_DMA_INT_ENSET_INT_ENSET_Msk & (_UINT32_(value) << CRYPTO_DMA_INT_ENSET_INT_ENSET_Pos)) /* Assignment of value for INT_ENSET in the CRYPTO_DMA_INT_ENSET register */
#define CRYPTO_DMA_INT_ENSET_Msk              _UINT32_(0xFFFFFFFF)                                 /* (CRYPTO_DMA_INT_ENSET) Register Mask  */


/* -------- CRYPTO_DMA_INT_ENCLR : (CRYPTO Offset: 0x24) ( /W 32)  -------- */
#define CRYPTO_DMA_INT_ENCLR_RESETVALUE       _UINT32_(0x00)                                       /*  (CRYPTO_DMA_INT_ENCLR)   Reset Value */

#define CRYPTO_DMA_INT_ENCLR_INT_ENCLR_Pos    _UINT32_(0)                                          /* (CRYPTO_DMA_INT_ENCLR)  Position */
#define CRYPTO_DMA_INT_ENCLR_INT_ENCLR_Msk    (_UINT32_(0xFFFFFFFF) << CRYPTO_DMA_INT_ENCLR_INT_ENCLR_Pos) /* (CRYPTO_DMA_INT_ENCLR)  Mask */
#define CRYPTO_DMA_INT_ENCLR_INT_ENCLR(value) (CRYPTO_DMA_INT_ENCLR_INT_ENCLR_Msk & (_UINT32_(value) << CRYPTO_DMA_INT_ENCLR_INT_ENCLR_Pos)) /* Assignment of value for INT_ENCLR in the CRYPTO_DMA_INT_ENCLR register */
#define CRYPTO_DMA_INT_ENCLR_Msk              _UINT32_(0xFFFFFFFF)                                 /* (CRYPTO_DMA_INT_ENCLR) Register Mask  */


