zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/include/component/crypto.h
/* -------- CRYPTO_DMA_INT_STATRAW : (CRYPTO Offset: 0x28) ( R/ 32)  -------- */
#define CRYPTO_DMA_INT_STATRAW_RESETVALUE     _UINT32_(0x00)                                       /*  (CRYPTO_DMA_INT_STATRAW)   Reset Value */

#define CRYPTO_DMA_INT_STATRAW_INT_STATRAW_Pos _UINT32_(0)                                          /* (CRYPTO_DMA_INT_STATRAW)  Position */
#define CRYPTO_DMA_INT_STATRAW_INT_STATRAW_Msk (_UINT32_(0xFFFFFFFF) << CRYPTO_DMA_INT_STATRAW_INT_STATRAW_Pos) /* (CRYPTO_DMA_INT_STATRAW)  Mask */
#define CRYPTO_DMA_INT_STATRAW_INT_STATRAW(value) (CRYPTO_DMA_INT_STATRAW_INT_STATRAW_Msk & (_UINT32_(value) << CRYPTO_DMA_INT_STATRAW_INT_STATRAW_Pos)) /* Assignment of value for INT_STATRAW in the CRYPTO_DMA_INT_STATRAW register */
#define CRYPTO_DMA_INT_STATRAW_Msk            _UINT32_(0xFFFFFFFF)                                 /* (CRYPTO_DMA_INT_STATRAW) Register Mask  */


/* -------- CRYPTO_DMA_INT_STAT : (CRYPTO Offset: 0x2C) ( R/ 32)  -------- */
#define CRYPTO_DMA_INT_STAT_RESETVALUE        _UINT32_(0x00)                                       /*  (CRYPTO_DMA_INT_STAT)   Reset Value */

#define CRYPTO_DMA_INT_STAT_INT_STAT_Pos      _UINT32_(0)                                          /* (CRYPTO_DMA_INT_STAT)  Position */
#define CRYPTO_DMA_INT_STAT_INT_STAT_Msk      (_UINT32_(0xFFFFFFFF) << CRYPTO_DMA_INT_STAT_INT_STAT_Pos) /* (CRYPTO_DMA_INT_STAT)  Mask */
#define CRYPTO_DMA_INT_STAT_INT_STAT(value)   (CRYPTO_DMA_INT_STAT_INT_STAT_Msk & (_UINT32_(value) << CRYPTO_DMA_INT_STAT_INT_STAT_Pos)) /* Assignment of value for INT_STAT in the CRYPTO_DMA_INT_STAT register */
#define CRYPTO_DMA_INT_STAT_Msk               _UINT32_(0xFFFFFFFF)                                 /* (CRYPTO_DMA_INT_STAT) Register Mask  */


/* -------- CRYPTO_DMA_INT_STATCLR : (CRYPTO Offset: 0x30) ( /W 32)  -------- */
#define CRYPTO_DMA_INT_STATCLR_RESETVALUE     _UINT32_(0x00)                                       /*  (CRYPTO_DMA_INT_STATCLR)   Reset Value */

#define CRYPTO_DMA_INT_STATCLR_INT_STATCLR_Pos _UINT32_(0)                                          /* (CRYPTO_DMA_INT_STATCLR)  Position */
#define CRYPTO_DMA_INT_STATCLR_INT_STATCLR_Msk (_UINT32_(0xFFFFFFFF) << CRYPTO_DMA_INT_STATCLR_INT_STATCLR_Pos) /* (CRYPTO_DMA_INT_STATCLR)  Mask */
#define CRYPTO_DMA_INT_STATCLR_INT_STATCLR(value) (CRYPTO_DMA_INT_STATCLR_INT_STATCLR_Msk & (_UINT32_(value) << CRYPTO_DMA_INT_STATCLR_INT_STATCLR_Pos)) /* Assignment of value for INT_STATCLR in the CRYPTO_DMA_INT_STATCLR register */
#define CRYPTO_DMA_INT_STATCLR_Msk            _UINT32_(0xFFFFFFFF)                                 /* (CRYPTO_DMA_INT_STATCLR) Register Mask  */


/* -------- CRYPTO_DMA_CONFIG : (CRYPTO Offset: 0x34) (R/W 32)  -------- */
#define CRYPTO_DMA_CONFIG_RESETVALUE          _UINT32_(0x00)                                       /*  (CRYPTO_DMA_CONFIG)   Reset Value */

#define CRYPTO_DMA_CONFIG_FETCH_CTRL_INDIRECT_Pos _UINT32_(0)                                          /* (CRYPTO_DMA_CONFIG)  Position */
#define CRYPTO_DMA_CONFIG_FETCH_CTRL_INDIRECT_Msk (_UINT32_(0x1) << CRYPTO_DMA_CONFIG_FETCH_CTRL_INDIRECT_Pos) /* (CRYPTO_DMA_CONFIG)  Mask */
#define CRYPTO_DMA_CONFIG_FETCH_CTRL_INDIRECT(value) (CRYPTO_DMA_CONFIG_FETCH_CTRL_INDIRECT_Msk & (_UINT32_(value) << CRYPTO_DMA_CONFIG_FETCH_CTRL_INDIRECT_Pos)) /* Assignment of value for FETCH_CTRL_INDIRECT in the CRYPTO_DMA_CONFIG register */
#define CRYPTO_DMA_CONFIG_PUSH_CTRL_INDIRECT_Pos _UINT32_(1)                                          /* (CRYPTO_DMA_CONFIG)  Position */
#define CRYPTO_DMA_CONFIG_PUSH_CTRL_INDIRECT_Msk (_UINT32_(0x1) << CRYPTO_DMA_CONFIG_PUSH_CTRL_INDIRECT_Pos) /* (CRYPTO_DMA_CONFIG)  Mask */
#define CRYPTO_DMA_CONFIG_PUSH_CTRL_INDIRECT(value) (CRYPTO_DMA_CONFIG_PUSH_CTRL_INDIRECT_Msk & (_UINT32_(value) << CRYPTO_DMA_CONFIG_PUSH_CTRL_INDIRECT_Pos)) /* Assignment of value for PUSH_CTRL_INDIRECT in the CRYPTO_DMA_CONFIG register */
#define CRYPTO_DMA_CONFIG_FETCH_STOP_Pos      _UINT32_(2)                                          /* (CRYPTO_DMA_CONFIG)  Position */
#define CRYPTO_DMA_CONFIG_FETCH_STOP_Msk      (_UINT32_(0x1) << CRYPTO_DMA_CONFIG_FETCH_STOP_Pos)  /* (CRYPTO_DMA_CONFIG)  Mask */
#define CRYPTO_DMA_CONFIG_FETCH_STOP(value)   (CRYPTO_DMA_CONFIG_FETCH_STOP_Msk & (_UINT32_(value) << CRYPTO_DMA_CONFIG_FETCH_STOP_Pos)) /* Assignment of value for FETCH_STOP in the CRYPTO_DMA_CONFIG register */
#define CRYPTO_DMA_CONFIG_PUSH_STOP_Pos       _UINT32_(3)                                          /* (CRYPTO_DMA_CONFIG)  Position */
#define CRYPTO_DMA_CONFIG_PUSH_STOP_Msk       (_UINT32_(0x1) << CRYPTO_DMA_CONFIG_PUSH_STOP_Pos)   /* (CRYPTO_DMA_CONFIG)  Mask */
#define CRYPTO_DMA_CONFIG_PUSH_STOP(value)    (CRYPTO_DMA_CONFIG_PUSH_STOP_Msk & (_UINT32_(value) << CRYPTO_DMA_CONFIG_PUSH_STOP_Pos)) /* Assignment of value for PUSH_STOP in the CRYPTO_DMA_CONFIG register */
#define CRYPTO_DMA_CONFIG_SOFT_RST_Pos        _UINT32_(4)                                          /* (CRYPTO_DMA_CONFIG)  Position */
#define CRYPTO_DMA_CONFIG_SOFT_RST_Msk        (_UINT32_(0x1) << CRYPTO_DMA_CONFIG_SOFT_RST_Pos)    /* (CRYPTO_DMA_CONFIG)  Mask */
#define CRYPTO_DMA_CONFIG_SOFT_RST(value)     (CRYPTO_DMA_CONFIG_SOFT_RST_Msk & (_UINT32_(value) << CRYPTO_DMA_CONFIG_SOFT_RST_Pos)) /* Assignment of value for SOFT_RST in the CRYPTO_DMA_CONFIG register */
#define CRYPTO_DMA_CONFIG_Msk                 _UINT32_(0x0000001F)                                 /* (CRYPTO_DMA_CONFIG) Register Mask  */


/* -------- CRYPTO_DMA_START : (CRYPTO Offset: 0x38) ( /W 32)  -------- */
#define CRYPTO_DMA_START_RESETVALUE           _UINT32_(0x00)                                       /*  (CRYPTO_DMA_START)   Reset Value */

#define CRYPTO_DMA_START_START_FETCH_Pos      _UINT32_(0)                                          /* (CRYPTO_DMA_START)  Position */
#define CRYPTO_DMA_START_START_FETCH_Msk      (_UINT32_(0x1) << CRYPTO_DMA_START_START_FETCH_Pos)  /* (CRYPTO_DMA_START)  Mask */
#define CRYPTO_DMA_START_START_FETCH(value)   (CRYPTO_DMA_START_START_FETCH_Msk & (_UINT32_(value) << CRYPTO_DMA_START_START_FETCH_Pos)) /* Assignment of value for START_FETCH in the CRYPTO_DMA_START register */
#define CRYPTO_DMA_START_START_PUSH_Pos       _UINT32_(1)                                          /* (CRYPTO_DMA_START)  Position */
#define CRYPTO_DMA_START_START_PUSH_Msk       (_UINT32_(0x1) << CRYPTO_DMA_START_START_PUSH_Pos)   /* (CRYPTO_DMA_START)  Mask */
#define CRYPTO_DMA_START_START_PUSH(value)    (CRYPTO_DMA_START_START_PUSH_Msk & (_UINT32_(value) << CRYPTO_DMA_START_START_PUSH_Pos)) /* Assignment of value for START_PUSH in the CRYPTO_DMA_START register */
#define CRYPTO_DMA_START_Msk                  _UINT32_(0x00000003)                                 /* (CRYPTO_DMA_START) Register Mask  */


/* -------- CRYPTO_DMA_STATUS : (CRYPTO Offset: 0x3C) ( R/ 32)  -------- */
#define CRYPTO_DMA_STATUS_RESETVALUE          _UINT32_(0x00)                                       /*  (CRYPTO_DMA_STATUS)   Reset Value */

#define CRYPTO_DMA_STATUS_FETCH_BUSY_Pos      _UINT32_(0)                                          /* (CRYPTO_DMA_STATUS)  Position */
#define CRYPTO_DMA_STATUS_FETCH_BUSY_Msk      (_UINT32_(0x1) << CRYPTO_DMA_STATUS_FETCH_BUSY_Pos)  /* (CRYPTO_DMA_STATUS)  Mask */
#define CRYPTO_DMA_STATUS_FETCH_BUSY(value)   (CRYPTO_DMA_STATUS_FETCH_BUSY_Msk & (_UINT32_(value) << CRYPTO_DMA_STATUS_FETCH_BUSY_Pos)) /* Assignment of value for FETCH_BUSY in the CRYPTO_DMA_STATUS register */
#define CRYPTO_DMA_STATUS_PUSH_BUSY_Pos       _UINT32_(1)                                          /* (CRYPTO_DMA_STATUS)  Position */
#define CRYPTO_DMA_STATUS_PUSH_BUSY_Msk       (_UINT32_(0x1) << CRYPTO_DMA_STATUS_PUSH_BUSY_Pos)   /* (CRYPTO_DMA_STATUS)  Mask */
#define CRYPTO_DMA_STATUS_PUSH_BUSY(value)    (CRYPTO_DMA_STATUS_PUSH_BUSY_Msk & (_UINT32_(value) << CRYPTO_DMA_STATUS_PUSH_BUSY_Pos)) /* Assignment of value for PUSH_BUSY in the CRYPTO_DMA_STATUS register */
#define CRYPTO_DMA_STATUS_FETCH_NOT_EMPTY_Pos _UINT32_(4)                                          /* (CRYPTO_DMA_STATUS)  Position */
#define CRYPTO_DMA_STATUS_FETCH_NOT_EMPTY_Msk (_UINT32_(0x1) << CRYPTO_DMA_STATUS_FETCH_NOT_EMPTY_Pos) /* (CRYPTO_DMA_STATUS)  Mask */
#define CRYPTO_DMA_STATUS_FETCH_NOT_EMPTY(value) (CRYPTO_DMA_STATUS_FETCH_NOT_EMPTY_Msk & (_UINT32_(value) << CRYPTO_DMA_STATUS_FETCH_NOT_EMPTY_Pos)) /* Assignment of value for FETCH_NOT_EMPTY in the CRYPTO_DMA_STATUS register */
#define CRYPTO_DMA_STATUS_PUSH_WAITINGFIFO_Pos _UINT32_(5)                                          /* (CRYPTO_DMA_STATUS)  Position */
#define CRYPTO_DMA_STATUS_PUSH_WAITINGFIFO_Msk (_UINT32_(0x1) << CRYPTO_DMA_STATUS_PUSH_WAITINGFIFO_Pos) /* (CRYPTO_DMA_STATUS)  Mask */
#define CRYPTO_DMA_STATUS_PUSH_WAITINGFIFO(value) (CRYPTO_DMA_STATUS_PUSH_WAITINGFIFO_Msk & (_UINT32_(value) << CRYPTO_DMA_STATUS_PUSH_WAITINGFIFO_Pos)) /* Assignment of value for PUSH_WAITINGFIFO in the CRYPTO_DMA_STATUS register */
#define CRYPTO_DMA_STATUS_SOFT_RST_BUSY_Pos   _UINT32_(6)                                          /* (CRYPTO_DMA_STATUS)  Position */
#define CRYPTO_DMA_STATUS_SOFT_RST_BUSY_Msk   (_UINT32_(0x1) << CRYPTO_DMA_STATUS_SOFT_RST_BUSY_Pos) /* (CRYPTO_DMA_STATUS)  Mask */
#define CRYPTO_DMA_STATUS_SOFT_RST_BUSY(value) (CRYPTO_DMA_STATUS_SOFT_RST_BUSY_Msk & (_UINT32_(value) << CRYPTO_DMA_STATUS_SOFT_RST_BUSY_Pos)) /* Assignment of value for SOFT_RST_BUSY in the CRYPTO_DMA_STATUS register */
#define CRYPTO_DMA_STATUS_PUSH_NBDATA_Pos     _UINT32_(16)                                         /* (CRYPTO_DMA_STATUS)  Position */
#define CRYPTO_DMA_STATUS_PUSH_NBDATA_Msk     (_UINT32_(0xFFFF) << CRYPTO_DMA_STATUS_PUSH_NBDATA_Pos) /* (CRYPTO_DMA_STATUS)  Mask */
#define CRYPTO_DMA_STATUS_PUSH_NBDATA(value)  (CRYPTO_DMA_STATUS_PUSH_NBDATA_Msk & (_UINT32_(value) << CRYPTO_DMA_STATUS_PUSH_NBDATA_Pos)) /* Assignment of value for PUSH_NBDATA in the CRYPTO_DMA_STATUS register */
#define CRYPTO_DMA_STATUS_Msk                 _UINT32_(0xFFFF0073)                                 /* (CRYPTO_DMA_STATUS) Register Mask  */


