zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/include/component/crypto.h
/* -------- CRYPTO_HWCONF_INCL_IPS_HW_CFG : (CRYPTO Offset: 0x400) ( R/ 32)  -------- */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_RESETVALUE _UINT32_(0x00)                                       /*  (CRYPTO_HWCONF_INCL_IPS_HW_CFG)   Reset Value */

#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA411_AES_INCLUDED_Pos _UINT32_(0)                                          /* (CRYPTO_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeAES value. BA411E-AES IP included if set Position */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA411_AES_INCLUDED_Msk (_UINT32_(0x1) << CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA411_AES_INCLUDED_Pos) /* (CRYPTO_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeAES value. BA411E-AES IP included if set Mask */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA411_AES_INCLUDED(value) (CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA411_AES_INCLUDED_Msk & (_UINT32_(value) << CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA411_AES_INCLUDED_Pos)) /* Assignment of value for BA411_AES_INCLUDED in the CRYPTO_HWCONF_INCL_IPS_HW_CFG register */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA415_HP_AES_GCM_INCLUDED_Pos _UINT32_(1)                                          /* (CRYPTO_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeAESGCM value. BA415-HP-AES-GCM IP included if set Position */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA415_HP_AES_GCM_INCLUDED_Msk (_UINT32_(0x1) << CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA415_HP_AES_GCM_INCLUDED_Pos) /* (CRYPTO_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeAESGCM value. BA415-HP-AES-GCM IP included if set Mask */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA415_HP_AES_GCM_INCLUDED(value) (CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA415_HP_AES_GCM_INCLUDED_Msk & (_UINT32_(value) << CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA415_HP_AES_GCM_INCLUDED_Pos)) /* Assignment of value for BA415_HP_AES_GCM_INCLUDED in the CRYPTO_HWCONF_INCL_IPS_HW_CFG register */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA416_HP_AES_XTS_INCLUDED_Pos _UINT32_(2)                                          /* (CRYPTO_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeAESXTS value. BA416-HP-AES-XTS IP included if set Position */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA416_HP_AES_XTS_INCLUDED_Msk (_UINT32_(0x1) << CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA416_HP_AES_XTS_INCLUDED_Pos) /* (CRYPTO_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeAESXTS value. BA416-HP-AES-XTS IP included if set Mask */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA416_HP_AES_XTS_INCLUDED(value) (CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA416_HP_AES_XTS_INCLUDED_Msk & (_UINT32_(value) << CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA416_HP_AES_XTS_INCLUDED_Pos)) /* Assignment of value for BA416_HP_AES_XTS_INCLUDED in the CRYPTO_HWCONF_INCL_IPS_HW_CFG register */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA412_DES_INCLUDED_Pos _UINT32_(3)                                          /* (CRYPTO_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeDES value. BA412-3DES IP included if set Position */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA412_DES_INCLUDED_Msk (_UINT32_(0x1) << CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA412_DES_INCLUDED_Pos) /* (CRYPTO_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeDES value. BA412-3DES IP included if set Mask */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA412_DES_INCLUDED(value) (CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA412_DES_INCLUDED_Msk & (_UINT32_(value) << CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA412_DES_INCLUDED_Pos)) /* Assignment of value for BA412_DES_INCLUDED in the CRYPTO_HWCONF_INCL_IPS_HW_CFG register */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA413_HASH_INCLUDED_Pos _UINT32_(4)                                          /* (CRYPTO_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeHASH value. BA413-HASH IP included if set Position */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA413_HASH_INCLUDED_Msk (_UINT32_(0x1) << CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA413_HASH_INCLUDED_Pos) /* (CRYPTO_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeHASH value. BA413-HASH IP included if set Mask */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA413_HASH_INCLUDED(value) (CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA413_HASH_INCLUDED_Msk & (_UINT32_(value) << CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA413_HASH_INCLUDED_Pos)) /* Assignment of value for BA413_HASH_INCLUDED in the CRYPTO_HWCONF_INCL_IPS_HW_CFG register */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA417_CHACHAPOLY_INCLUDED_Pos _UINT32_(5)                                          /* (CRYPTO_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeChachaPoly value. BA417-ChaChaPoly IP included if set Position */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA417_CHACHAPOLY_INCLUDED_Msk (_UINT32_(0x1) << CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA417_CHACHAPOLY_INCLUDED_Pos) /* (CRYPTO_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeChachaPoly value. BA417-ChaChaPoly IP included if set Mask */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA417_CHACHAPOLY_INCLUDED(value) (CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA417_CHACHAPOLY_INCLUDED_Msk & (_UINT32_(value) << CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA417_CHACHAPOLY_INCLUDED_Pos)) /* Assignment of value for BA417_CHACHAPOLY_INCLUDED in the CRYPTO_HWCONF_INCL_IPS_HW_CFG register */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA418_SHA3_INCLUDED_Pos _UINT32_(6)                                          /* (CRYPTO_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeSHA3  value. BA418-SHA3 IP included if set Position */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA418_SHA3_INCLUDED_Msk (_UINT32_(0x1) << CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA418_SHA3_INCLUDED_Pos) /* (CRYPTO_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeSHA3  value. BA418-SHA3 IP included if set Mask */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA418_SHA3_INCLUDED(value) (CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA418_SHA3_INCLUDED_Msk & (_UINT32_(value) << CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA418_SHA3_INCLUDED_Pos)) /* Assignment of value for BA418_SHA3_INCLUDED in the CRYPTO_HWCONF_INCL_IPS_HW_CFG register */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA421_ZUC_INCLUDED_Pos _UINT32_(7)                                          /* (CRYPTO_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeZUC  value. BA421-ZUC IP included if set Position */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA421_ZUC_INCLUDED_Msk (_UINT32_(0x1) << CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA421_ZUC_INCLUDED_Pos) /* (CRYPTO_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeZUC  value. BA421-ZUC IP included if set Mask */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA421_ZUC_INCLUDED(value) (CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA421_ZUC_INCLUDED_Msk & (_UINT32_(value) << CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA421_ZUC_INCLUDED_Pos)) /* Assignment of value for BA421_ZUC_INCLUDED in the CRYPTO_HWCONF_INCL_IPS_HW_CFG register */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA419_SM4_INCLUDED_Pos _UINT32_(8)                                          /* (CRYPTO_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeSM4  value. BA419-SM4 IP included if set Position */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA419_SM4_INCLUDED_Msk (_UINT32_(0x1) << CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA419_SM4_INCLUDED_Pos) /* (CRYPTO_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeSM4  value. BA419-SM4 IP included if set Mask */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA419_SM4_INCLUDED(value) (CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA419_SM4_INCLUDED_Msk & (_UINT32_(value) << CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA419_SM4_INCLUDED_Pos)) /* Assignment of value for BA419_SM4_INCLUDED in the CRYPTO_HWCONF_INCL_IPS_HW_CFG register */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA414EP_PKE_INCLUDED_Pos _UINT32_(9)                                          /* (CRYPTO_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludePKE  value. BA414EP-PKE IP included if set Position */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA414EP_PKE_INCLUDED_Msk (_UINT32_(0x1) << CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA414EP_PKE_INCLUDED_Pos) /* (CRYPTO_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludePKE  value. BA414EP-PKE IP included if set Mask */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA414EP_PKE_INCLUDED(value) (CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA414EP_PKE_INCLUDED_Msk & (_UINT32_(value) << CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA414EP_PKE_INCLUDED_Pos)) /* Assignment of value for BA414EP_PKE_INCLUDED in the CRYPTO_HWCONF_INCL_IPS_HW_CFG register */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA431_NDRNG_INCLUDED_Pos _UINT32_(10)                                         /* (CRYPTO_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeNDRNG  value. BA431-NDRNG IP included if set Position */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA431_NDRNG_INCLUDED_Msk (_UINT32_(0x1) << CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA431_NDRNG_INCLUDED_Pos) /* (CRYPTO_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeNDRNG  value. BA431-NDRNG IP included if set Mask */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA431_NDRNG_INCLUDED(value) (CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA431_NDRNG_INCLUDED_Msk & (_UINT32_(value) << CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA431_NDRNG_INCLUDED_Pos)) /* Assignment of value for BA431_NDRNG_INCLUDED in the CRYPTO_HWCONF_INCL_IPS_HW_CFG register */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA420_HP_CHACHAPOLY_INCLUDED_Pos _UINT32_(11)                                         /* (CRYPTO_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeHPChachaPoly  value. BA420-HP-ChaChaPoly IP included if set Position */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA420_HP_CHACHAPOLY_INCLUDED_Msk (_UINT32_(0x1) << CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA420_HP_CHACHAPOLY_INCLUDED_Pos) /* (CRYPTO_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeHPChachaPoly  value. BA420-HP-ChaChaPoly IP included if set Mask */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA420_HP_CHACHAPOLY_INCLUDED(value) (CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA420_HP_CHACHAPOLY_INCLUDED_Msk & (_UINT32_(value) << CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA420_HP_CHACHAPOLY_INCLUDED_Pos)) /* Assignment of value for BA420_HP_CHACHAPOLY_INCLUDED in the CRYPTO_HWCONF_INCL_IPS_HW_CFG register */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA423_SNOW3G_INCLUDED_Pos _UINT32_(12)                                         /* (CRYPTO_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeSnow3G  value. BA423-Snow3G IP included if set Position */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA423_SNOW3G_INCLUDED_Msk (_UINT32_(0x1) << CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA423_SNOW3G_INCLUDED_Pos) /* (CRYPTO_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeSnow3G  value. BA423-Snow3G IP included if set Mask */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA423_SNOW3G_INCLUDED(value) (CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA423_SNOW3G_INCLUDED_Msk & (_UINT32_(value) << CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA423_SNOW3G_INCLUDED_Pos)) /* Assignment of value for BA423_SNOW3G_INCLUDED in the CRYPTO_HWCONF_INCL_IPS_HW_CFG register */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA422_KASUMI_INCLUDED_Pos _UINT32_(13)                                         /* (CRYPTO_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeKasumi  value. BA422-Kasumi IP included if set Position */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA422_KASUMI_INCLUDED_Msk (_UINT32_(0x1) << CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA422_KASUMI_INCLUDED_Pos) /* (CRYPTO_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeKasumi  value. BA422-Kasumi IP included if set Mask */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA422_KASUMI_INCLUDED(value) (CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA422_KASUMI_INCLUDED_Msk & (_UINT32_(value) << CRYPTO_HWCONF_INCL_IPS_HW_CFG_BA422_KASUMI_INCLUDED_Pos)) /* Assignment of value for BA422_KASUMI_INCLUDED in the CRYPTO_HWCONF_INCL_IPS_HW_CFG register */
#define CRYPTO_HWCONF_INCL_IPS_HW_CFG_Msk     _UINT32_(0x00003FFF)                                 /* (CRYPTO_HWCONF_INCL_IPS_HW_CFG) Register Mask  */


/* -------- CRYPTO_HWCONF_BA411E_AES_HW_CFG_1 : (CRYPTO Offset: 0x404) ( R/ 32)  -------- */
#define CRYPTO_HWCONF_BA411E_AES_HW_CFG_1_RESETVALUE _UINT32_(0x00)                                       /*  (CRYPTO_HWCONF_BA411E_AES_HW_CFG_1)   Reset Value */

