zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/include/component/crypto.h
#define CRYPTO_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MODE_Pos _UINT32_(0)                                          /* (CRYPTO_HWCONF_BA411E_AES_HW_CFG_1) Generic g_AesModesPoss value. BA411E-AES engine configuration. Position */
#define CRYPTO_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MODE_Msk (_UINT32_(0x1FF) << CRYPTO_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MODE_Pos) /* (CRYPTO_HWCONF_BA411E_AES_HW_CFG_1) Generic g_AesModesPoss value. BA411E-AES engine configuration. Mask */
#define CRYPTO_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MODE(value) (CRYPTO_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MODE_Msk & (_UINT32_(value) << CRYPTO_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MODE_Pos)) /* Assignment of value for BA411E_AES_HW_CFG_MODE in the CRYPTO_HWCONF_BA411E_AES_HW_CFG_1 register */
#define CRYPTO_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_CS_Pos _UINT32_(16)                                         /* (CRYPTO_HWCONF_BA411E_AES_HW_CFG_1) Generic g_CS value. BA411E-AES engine configuration. Position */
#define CRYPTO_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_CS_Msk (_UINT32_(0x1) << CRYPTO_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_CS_Pos) /* (CRYPTO_HWCONF_BA411E_AES_HW_CFG_1) Generic g_CS value. BA411E-AES engine configuration. Mask */
#define CRYPTO_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_CS(value) (CRYPTO_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_CS_Msk & (_UINT32_(value) << CRYPTO_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_CS_Pos)) /* Assignment of value for BA411E_AES_HW_CFG_CS in the CRYPTO_HWCONF_BA411E_AES_HW_CFG_1 register */
#define CRYPTO_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MASKING_Pos _UINT32_(17)                                         /* (CRYPTO_HWCONF_BA411E_AES_HW_CFG_1) Generic g_UseMasking value. BA411E-AES engine configuration. Position */
#define CRYPTO_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MASKING_Msk (_UINT32_(0x1) << CRYPTO_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MASKING_Pos) /* (CRYPTO_HWCONF_BA411E_AES_HW_CFG_1) Generic g_UseMasking value. BA411E-AES engine configuration. Mask */
#define CRYPTO_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MASKING(value) (CRYPTO_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MASKING_Msk & (_UINT32_(value) << CRYPTO_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MASKING_Pos)) /* Assignment of value for BA411E_AES_HW_CFG_MASKING in the CRYPTO_HWCONF_BA411E_AES_HW_CFG_1 register */
#define CRYPTO_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_KEYSIZE_Pos _UINT32_(24)                                         /* (CRYPTO_HWCONF_BA411E_AES_HW_CFG_1) Generic g_Keysize value. BA411E-AES engine configuration. Position */
#define CRYPTO_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_KEYSIZE_Msk (_UINT32_(0x7) << CRYPTO_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_KEYSIZE_Pos) /* (CRYPTO_HWCONF_BA411E_AES_HW_CFG_1) Generic g_Keysize value. BA411E-AES engine configuration. Mask */
#define CRYPTO_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_KEYSIZE(value) (CRYPTO_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_KEYSIZE_Msk & (_UINT32_(value) << CRYPTO_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_KEYSIZE_Pos)) /* Assignment of value for BA411E_AES_HW_CFG_KEYSIZE in the CRYPTO_HWCONF_BA411E_AES_HW_CFG_1 register */
#define CRYPTO_HWCONF_BA411E_AES_HW_CFG_1_Msk _UINT32_(0x070301FF)                                 /* (CRYPTO_HWCONF_BA411E_AES_HW_CFG_1) Register Mask  */


/* -------- CRYPTO_HWCONF_BA411E_AES_HW_CFG_2 : (CRYPTO Offset: 0x408) ( R/ 32) Generic g_CtrSize value. BA411E-AES engine configuration. -------- */
#define CRYPTO_HWCONF_BA411E_AES_HW_CFG_2_RESETVALUE _UINT32_(0x00)                                       /*  (CRYPTO_HWCONF_BA411E_AES_HW_CFG_2) Generic g_CtrSize value. BA411E-AES engine configuration.  Reset Value */

#define CRYPTO_HWCONF_BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_Pos _UINT32_(0)                                          /* (CRYPTO_HWCONF_BA411E_AES_HW_CFG_2) Generic g_CtrSize value. BA411E-AES engine configuration. Position */
#define CRYPTO_HWCONF_BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_Msk (_UINT32_(0xFFFF) << CRYPTO_HWCONF_BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_Pos) /* (CRYPTO_HWCONF_BA411E_AES_HW_CFG_2) Generic g_CtrSize value. BA411E-AES engine configuration. Mask */
#define CRYPTO_HWCONF_BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2(value) (CRYPTO_HWCONF_BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_Msk & (_UINT32_(value) << CRYPTO_HWCONF_BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_Pos)) /* Assignment of value for BA411E_AES_HW_CFG_2 in the CRYPTO_HWCONF_BA411E_AES_HW_CFG_2 register */
#define CRYPTO_HWCONF_BA411E_AES_HW_CFG_2_Msk _UINT32_(0x0000FFFF)                                 /* (CRYPTO_HWCONF_BA411E_AES_HW_CFG_2) Register Mask  */


/* -------- CRYPTO_HWCONF_BA413_HASH_HW_CFG : (CRYPTO Offset: 0x40C) ( R/ 32)  -------- */
#define CRYPTO_HWCONF_BA413_HASH_HW_CFG_RESETVALUE _UINT32_(0x00)                                       /*  (CRYPTO_HWCONF_BA413_HASH_HW_CFG)   Reset Value */

#define CRYPTO_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_MASK_Pos _UINT32_(0)                                          /* (CRYPTO_HWCONF_BA413_HASH_HW_CFG) Generic g_HashMaskFunc value. BA413-Hash engine configuration. Position */
#define CRYPTO_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_MASK_Msk (_UINT32_(0x7F) << CRYPTO_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_MASK_Pos) /* (CRYPTO_HWCONF_BA413_HASH_HW_CFG) Generic g_HashMaskFunc value. BA413-Hash engine configuration. Mask */
#define CRYPTO_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_MASK(value) (CRYPTO_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_MASK_Msk & (_UINT32_(value) << CRYPTO_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_MASK_Pos)) /* Assignment of value for BA413_HASH_HW_CFG_MASK in the CRYPTO_HWCONF_BA413_HASH_HW_CFG register */
#define CRYPTO_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_PASSING_Pos _UINT32_(16)                                         /* (CRYPTO_HWCONF_BA413_HASH_HW_CFG) Generic g_HashPadding value. BA413-Hash engine configuration. Position */
#define CRYPTO_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_PASSING_Msk (_UINT32_(0x1) << CRYPTO_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_PASSING_Pos) /* (CRYPTO_HWCONF_BA413_HASH_HW_CFG) Generic g_HashPadding value. BA413-Hash engine configuration. Mask */
#define CRYPTO_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_PASSING(value) (CRYPTO_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_PASSING_Msk & (_UINT32_(value) << CRYPTO_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_PASSING_Pos)) /* Assignment of value for BA413_HASH_HW_CFG_PASSING in the CRYPTO_HWCONF_BA413_HASH_HW_CFG register */
#define CRYPTO_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_HMAC_Pos _UINT32_(17)                                         /* (CRYPTO_HWCONF_BA413_HASH_HW_CFG) Generic g_HMAC_enabled value. BA413-Hash engine configuration. Position */
#define CRYPTO_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_HMAC_Msk (_UINT32_(0x1) << CRYPTO_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_HMAC_Pos) /* (CRYPTO_HWCONF_BA413_HASH_HW_CFG) Generic g_HMAC_enabled value. BA413-Hash engine configuration. Mask */
#define CRYPTO_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_HMAC(value) (CRYPTO_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_HMAC_Msk & (_UINT32_(value) << CRYPTO_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_HMAC_Pos)) /* Assignment of value for BA413_HASH_HW_CFG_HMAC in the CRYPTO_HWCONF_BA413_HASH_HW_CFG register */
#define CRYPTO_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_VERIFYDIGEST_Pos _UINT32_(18)                                         /* (CRYPTO_HWCONF_BA413_HASH_HW_CFG) Generic g_HashVerifyDigest value. BA413-Hash engine configuration. Position */
#define CRYPTO_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_VERIFYDIGEST_Msk (_UINT32_(0x1) << CRYPTO_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_VERIFYDIGEST_Pos) /* (CRYPTO_HWCONF_BA413_HASH_HW_CFG) Generic g_HashVerifyDigest value. BA413-Hash engine configuration. Mask */
#define CRYPTO_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_VERIFYDIGEST(value) (CRYPTO_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_VERIFYDIGEST_Msk & (_UINT32_(value) << CRYPTO_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_VERIFYDIGEST_Pos)) /* Assignment of value for BA413_HASH_HW_CFG_VERIFYDIGEST in the CRYPTO_HWCONF_BA413_HASH_HW_CFG register */
#define CRYPTO_HWCONF_BA413_HASH_HW_CFG_Msk   _UINT32_(0x0007007F)                                 /* (CRYPTO_HWCONF_BA413_HASH_HW_CFG) Register Mask  */


/* -------- CRYPTO_HWCONF_BA418_SHA3_HW_CFG : (CRYPTO Offset: 0x410) ( R/ 32) Generic g_Sha3CtxtEn value. BA418-SHA3 configuration. -------- */
#define CRYPTO_HWCONF_BA418_SHA3_HW_CFG_RESETVALUE _UINT32_(0x00)                                       /*  (CRYPTO_HWCONF_BA418_SHA3_HW_CFG) Generic g_Sha3CtxtEn value. BA418-SHA3 configuration.  Reset Value */

#define CRYPTO_HWCONF_BA418_SHA3_HW_CFG_BA418_SHA3_HW_CFG_Pos _UINT32_(0)                                          /* (CRYPTO_HWCONF_BA418_SHA3_HW_CFG) Generic g_Sha3CtxtEn value. BA418-SHA3 configuration. Position */
#define CRYPTO_HWCONF_BA418_SHA3_HW_CFG_BA418_SHA3_HW_CFG_Msk (_UINT32_(0x1) << CRYPTO_HWCONF_BA418_SHA3_HW_CFG_BA418_SHA3_HW_CFG_Pos) /* (CRYPTO_HWCONF_BA418_SHA3_HW_CFG) Generic g_Sha3CtxtEn value. BA418-SHA3 configuration. Mask */
#define CRYPTO_HWCONF_BA418_SHA3_HW_CFG_BA418_SHA3_HW_CFG(value) (CRYPTO_HWCONF_BA418_SHA3_HW_CFG_BA418_SHA3_HW_CFG_Msk & (_UINT32_(value) << CRYPTO_HWCONF_BA418_SHA3_HW_CFG_BA418_SHA3_HW_CFG_Pos)) /* Assignment of value for BA418_SHA3_HW_CFG in the CRYPTO_HWCONF_BA418_SHA3_HW_CFG register */
#define CRYPTO_HWCONF_BA418_SHA3_HW_CFG_Msk   _UINT32_(0x00000001)                                 /* (CRYPTO_HWCONF_BA418_SHA3_HW_CFG) Register Mask  */


/* -------- CRYPTO_HWCONF_BA419_SM4_HW_CFG : (CRYPTO Offset: 0x414) ( R/ 32) Generic g_SM4ModesPoss value. BA419-SM4 engine configuration. -------- */
#define CRYPTO_HWCONF_BA419_SM4_HW_CFG_RESETVALUE _UINT32_(0x00)                                       /*  (CRYPTO_HWCONF_BA419_SM4_HW_CFG) Generic g_SM4ModesPoss value. BA419-SM4 engine configuration.  Reset Value */

#define CRYPTO_HWCONF_BA419_SM4_HW_CFG_BA419_SM4_HW_CFG_Pos _UINT32_(0)                                          /* (CRYPTO_HWCONF_BA419_SM4_HW_CFG) Generic g_SM4ModesPoss value. BA419-SM4 engine configuration. Position */
#define CRYPTO_HWCONF_BA419_SM4_HW_CFG_BA419_SM4_HW_CFG_Msk (_UINT32_(0x7F) << CRYPTO_HWCONF_BA419_SM4_HW_CFG_BA419_SM4_HW_CFG_Pos) /* (CRYPTO_HWCONF_BA419_SM4_HW_CFG) Generic g_SM4ModesPoss value. BA419-SM4 engine configuration. Mask */
#define CRYPTO_HWCONF_BA419_SM4_HW_CFG_BA419_SM4_HW_CFG(value) (CRYPTO_HWCONF_BA419_SM4_HW_CFG_BA419_SM4_HW_CFG_Msk & (_UINT32_(value) << CRYPTO_HWCONF_BA419_SM4_HW_CFG_BA419_SM4_HW_CFG_Pos)) /* Assignment of value for BA419_SM4_HW_CFG in the CRYPTO_HWCONF_BA419_SM4_HW_CFG register */
#define CRYPTO_HWCONF_BA419_SM4_HW_CFG_Msk    _UINT32_(0x0000007F)                                 /* (CRYPTO_HWCONF_BA419_SM4_HW_CFG) Register Mask  */


/* -------- CRYPTO_HWCONF_BA424_ARIA_HW_CFG : (CRYPTO Offset: 0x418) ( R/ 32) Generic g_aria_modePoss value. BA424-Aria engine configuration. -------- */
#define CRYPTO_HWCONF_BA424_ARIA_HW_CFG_RESETVALUE _UINT32_(0x00)                                       /*  (CRYPTO_HWCONF_BA424_ARIA_HW_CFG) Generic g_aria_modePoss value. BA424-Aria engine configuration.  Reset Value */

#define CRYPTO_HWCONF_BA424_ARIA_HW_CFG_BA424_ARIA_HW_CFG_Pos _UINT32_(0)                                          /* (CRYPTO_HWCONF_BA424_ARIA_HW_CFG) Generic g_aria_modePoss value. BA424-Aria engine configuration. Position */
#define CRYPTO_HWCONF_BA424_ARIA_HW_CFG_BA424_ARIA_HW_CFG_Msk (_UINT32_(0x1FF) << CRYPTO_HWCONF_BA424_ARIA_HW_CFG_BA424_ARIA_HW_CFG_Pos) /* (CRYPTO_HWCONF_BA424_ARIA_HW_CFG) Generic g_aria_modePoss value. BA424-Aria engine configuration. Mask */
#define CRYPTO_HWCONF_BA424_ARIA_HW_CFG_BA424_ARIA_HW_CFG(value) (CRYPTO_HWCONF_BA424_ARIA_HW_CFG_BA424_ARIA_HW_CFG_Msk & (_UINT32_(value) << CRYPTO_HWCONF_BA424_ARIA_HW_CFG_BA424_ARIA_HW_CFG_Pos)) /* Assignment of value for BA424_ARIA_HW_CFG in the CRYPTO_HWCONF_BA424_ARIA_HW_CFG register */
#define CRYPTO_HWCONF_BA424_ARIA_HW_CFG_Msk   _UINT32_(0x000001FF)                                 /* (CRYPTO_HWCONF_BA424_ARIA_HW_CFG) Register Mask  */


/* -------- CRYPTO_RNG_CONTROL_CONTROL : (CRYPTO Offset: 0x1000) (R/W 32) Control register -------- */
#define CRYPTO_RNG_CONTROL_CONTROL_RESETVALUE _UINT32_(0x00)                                       /*  (CRYPTO_RNG_CONTROL_CONTROL) Control register  Reset Value */

