zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/include/component/crypto.h
#define CRYPTO_RNG_CONTROL_KEY3_KEY3_Pos      _UINT32_(0)                                          /* (CRYPTO_RNG_CONTROL_KEY3) Key register (LSB). Position */
#define CRYPTO_RNG_CONTROL_KEY3_KEY3_Msk      (_UINT32_(0xFFFFFFFF) << CRYPTO_RNG_CONTROL_KEY3_KEY3_Pos) /* (CRYPTO_RNG_CONTROL_KEY3) Key register (LSB). Mask */
#define CRYPTO_RNG_CONTROL_KEY3_KEY3(value)   (CRYPTO_RNG_CONTROL_KEY3_KEY3_Msk & (_UINT32_(value) << CRYPTO_RNG_CONTROL_KEY3_KEY3_Pos)) /* Assignment of value for KEY3 in the CRYPTO_RNG_CONTROL_KEY3 register */
#define CRYPTO_RNG_CONTROL_KEY3_Msk           _UINT32_(0xFFFFFFFF)                                 /* (CRYPTO_RNG_CONTROL_KEY3) Register Mask  */


/* -------- CRYPTO_RNG_CONTROL_TESTDATA : (CRYPTO Offset: 0x1020) ( /W 32) Test data register. -------- */
#define CRYPTO_RNG_CONTROL_TESTDATA_RESETVALUE _UINT32_(0x00)                                       /*  (CRYPTO_RNG_CONTROL_TESTDATA) Test data register.  Reset Value */

#define CRYPTO_RNG_CONTROL_TESTDATA_TESTDATA_Pos _UINT32_(0)                                          /* (CRYPTO_RNG_CONTROL_TESTDATA) Test data register. Position */
#define CRYPTO_RNG_CONTROL_TESTDATA_TESTDATA_Msk (_UINT32_(0xFFFFFFFF) << CRYPTO_RNG_CONTROL_TESTDATA_TESTDATA_Pos) /* (CRYPTO_RNG_CONTROL_TESTDATA) Test data register. Mask */
#define CRYPTO_RNG_CONTROL_TESTDATA_TESTDATA(value) (CRYPTO_RNG_CONTROL_TESTDATA_TESTDATA_Msk & (_UINT32_(value) << CRYPTO_RNG_CONTROL_TESTDATA_TESTDATA_Pos)) /* Assignment of value for TESTDATA in the CRYPTO_RNG_CONTROL_TESTDATA register */
#define CRYPTO_RNG_CONTROL_TESTDATA_Msk       _UINT32_(0xFFFFFFFF)                                 /* (CRYPTO_RNG_CONTROL_TESTDATA) Register Mask  */


/* -------- CRYPTO_RNG_CONTROL_REPEATTHRESHOLD : (CRYPTO Offset: 0x1024) (R/W 32) Repetition Test Count Cut-Off value. -------- */
#define CRYPTO_RNG_CONTROL_REPEATTHRESHOLD_RESETVALUE _UINT32_(0x00)                                       /*  (CRYPTO_RNG_CONTROL_REPEATTHRESHOLD) Repetition Test Count Cut-Off value.  Reset Value */

#define CRYPTO_RNG_CONTROL_REPEATTHRESHOLD_REPEATTHRESHOLD_Pos _UINT32_(0)                                          /* (CRYPTO_RNG_CONTROL_REPEATTHRESHOLD) Repetition Test Count Cut-Off value. Position */
#define CRYPTO_RNG_CONTROL_REPEATTHRESHOLD_REPEATTHRESHOLD_Msk (_UINT32_(0xFFFFFFFF) << CRYPTO_RNG_CONTROL_REPEATTHRESHOLD_REPEATTHRESHOLD_Pos) /* (CRYPTO_RNG_CONTROL_REPEATTHRESHOLD) Repetition Test Count Cut-Off value. Mask */
#define CRYPTO_RNG_CONTROL_REPEATTHRESHOLD_REPEATTHRESHOLD(value) (CRYPTO_RNG_CONTROL_REPEATTHRESHOLD_REPEATTHRESHOLD_Msk & (_UINT32_(value) << CRYPTO_RNG_CONTROL_REPEATTHRESHOLD_REPEATTHRESHOLD_Pos)) /* Assignment of value for REPEATTHRESHOLD in the CRYPTO_RNG_CONTROL_REPEATTHRESHOLD register */
#define CRYPTO_RNG_CONTROL_REPEATTHRESHOLD_Msk _UINT32_(0xFFFFFFFF)                                 /* (CRYPTO_RNG_CONTROL_REPEATTHRESHOLD) Register Mask  */


/* -------- CRYPTO_RNG_CONTROL_PROPTHRESHOLD : (CRYPTO Offset: 0x1028) (R/W 32) Adaptive Proportion Test (1024-sample window) Cut-Off value. -------- */
#define CRYPTO_RNG_CONTROL_PROPTHRESHOLD_RESETVALUE _UINT32_(0x00)                                       /*  (CRYPTO_RNG_CONTROL_PROPTHRESHOLD) Adaptive Proportion Test (1024-sample window) Cut-Off value.  Reset Value */

#define CRYPTO_RNG_CONTROL_PROPTHRESHOLD_PROPTHRESHOLD_Pos _UINT32_(0)                                          /* (CRYPTO_RNG_CONTROL_PROPTHRESHOLD) Adaptive Proportion Test (1024-sample window) Cut-Off value. Position */
#define CRYPTO_RNG_CONTROL_PROPTHRESHOLD_PROPTHRESHOLD_Msk (_UINT32_(0xFFFFFFFF) << CRYPTO_RNG_CONTROL_PROPTHRESHOLD_PROPTHRESHOLD_Pos) /* (CRYPTO_RNG_CONTROL_PROPTHRESHOLD) Adaptive Proportion Test (1024-sample window) Cut-Off value. Mask */
#define CRYPTO_RNG_CONTROL_PROPTHRESHOLD_PROPTHRESHOLD(value) (CRYPTO_RNG_CONTROL_PROPTHRESHOLD_PROPTHRESHOLD_Msk & (_UINT32_(value) << CRYPTO_RNG_CONTROL_PROPTHRESHOLD_PROPTHRESHOLD_Pos)) /* Assignment of value for PROPTHRESHOLD in the CRYPTO_RNG_CONTROL_PROPTHRESHOLD register */
#define CRYPTO_RNG_CONTROL_PROPTHRESHOLD_Msk  _UINT32_(0xFFFFFFFF)                                 /* (CRYPTO_RNG_CONTROL_PROPTHRESHOLD) Register Mask  */


/* -------- CRYPTO_RNG_CONTROL_STATUS : (CRYPTO Offset: 0x1030) (R/W 32) Status register. -------- */
#define CRYPTO_RNG_CONTROL_STATUS_RESETVALUE  _UINT32_(0x00)                                       /*  (CRYPTO_RNG_CONTROL_STATUS) Status register.  Reset Value */

#define CRYPTO_RNG_CONTROL_STATUS_TESTDATABUSY_Pos _UINT32_(0)                                          /* (CRYPTO_RNG_CONTROL_STATUS) High when data written to TestData register is being processed. (see section 4.7) Position */
#define CRYPTO_RNG_CONTROL_STATUS_TESTDATABUSY_Msk (_UINT32_(0x1) << CRYPTO_RNG_CONTROL_STATUS_TESTDATABUSY_Pos) /* (CRYPTO_RNG_CONTROL_STATUS) High when data written to TestData register is being processed. (see section 4.7) Mask */
#define CRYPTO_RNG_CONTROL_STATUS_TESTDATABUSY(value) (CRYPTO_RNG_CONTROL_STATUS_TESTDATABUSY_Msk & (_UINT32_(value) << CRYPTO_RNG_CONTROL_STATUS_TESTDATABUSY_Pos)) /* Assignment of value for TESTDATABUSY in the CRYPTO_RNG_CONTROL_STATUS register */
#define CRYPTO_RNG_CONTROL_STATUS_STATE_Pos   _UINT32_(1)                                          /* (CRYPTO_RNG_CONTROL_STATUS) State of the control FSM: 000: Reset, 001: Startup, 010: Idle (Rings On), 011: Idle (Rings Off), 100: Fill FIFO, 101: Error, 110: Unused, 111: Unused. Position */
#define CRYPTO_RNG_CONTROL_STATUS_STATE_Msk   (_UINT32_(0x7) << CRYPTO_RNG_CONTROL_STATUS_STATE_Pos) /* (CRYPTO_RNG_CONTROL_STATUS) State of the control FSM: 000: Reset, 001: Startup, 010: Idle (Rings On), 011: Idle (Rings Off), 100: Fill FIFO, 101: Error, 110: Unused, 111: Unused. Mask */
#define CRYPTO_RNG_CONTROL_STATUS_STATE(value) (CRYPTO_RNG_CONTROL_STATUS_STATE_Msk & (_UINT32_(value) << CRYPTO_RNG_CONTROL_STATUS_STATE_Pos)) /* Assignment of value for STATE in the CRYPTO_RNG_CONTROL_STATUS register */
#define CRYPTO_RNG_CONTROL_STATUS_REPFAIL_Pos _UINT32_(4)                                          /* (CRYPTO_RNG_CONTROL_STATUS) NIST-800-90B repetition Count Test interrupt status. Position */
#define CRYPTO_RNG_CONTROL_STATUS_REPFAIL_Msk (_UINT32_(0x1) << CRYPTO_RNG_CONTROL_STATUS_REPFAIL_Pos) /* (CRYPTO_RNG_CONTROL_STATUS) NIST-800-90B repetition Count Test interrupt status. Mask */
#define CRYPTO_RNG_CONTROL_STATUS_REPFAIL(value) (CRYPTO_RNG_CONTROL_STATUS_REPFAIL_Msk & (_UINT32_(value) << CRYPTO_RNG_CONTROL_STATUS_REPFAIL_Pos)) /* Assignment of value for REPFAIL in the CRYPTO_RNG_CONTROL_STATUS register */
#define CRYPTO_RNG_CONTROL_STATUS_PROPFAIL_Pos _UINT32_(5)                                          /* (CRYPTO_RNG_CONTROL_STATUS) NIST-800-90B adaptive Proportion Test (1024-sample window) interrupt status. Position */
#define CRYPTO_RNG_CONTROL_STATUS_PROPFAIL_Msk (_UINT32_(0x1) << CRYPTO_RNG_CONTROL_STATUS_PROPFAIL_Pos) /* (CRYPTO_RNG_CONTROL_STATUS) NIST-800-90B adaptive Proportion Test (1024-sample window) interrupt status. Mask */
#define CRYPTO_RNG_CONTROL_STATUS_PROPFAIL(value) (CRYPTO_RNG_CONTROL_STATUS_PROPFAIL_Msk & (_UINT32_(value) << CRYPTO_RNG_CONTROL_STATUS_PROPFAIL_Pos)) /* Assignment of value for PROPFAIL in the CRYPTO_RNG_CONTROL_STATUS register */
#define CRYPTO_RNG_CONTROL_STATUS_FULLINT_Pos _UINT32_(7)                                          /* (CRYPTO_RNG_CONTROL_STATUS) FIFO full status. Position */
#define CRYPTO_RNG_CONTROL_STATUS_FULLINT_Msk (_UINT32_(0x1) << CRYPTO_RNG_CONTROL_STATUS_FULLINT_Pos) /* (CRYPTO_RNG_CONTROL_STATUS) FIFO full status. Mask */
#define CRYPTO_RNG_CONTROL_STATUS_FULLINT(value) (CRYPTO_RNG_CONTROL_STATUS_FULLINT_Msk & (_UINT32_(value) << CRYPTO_RNG_CONTROL_STATUS_FULLINT_Pos)) /* Assignment of value for FULLINT in the CRYPTO_RNG_CONTROL_STATUS register */
#define CRYPTO_RNG_CONTROL_STATUS_PREINT_Pos  _UINT32_(8)                                          /* (CRYPTO_RNG_CONTROL_STATUS) AIS31 preliminary noise alarm interrupt status. Position */
#define CRYPTO_RNG_CONTROL_STATUS_PREINT_Msk  (_UINT32_(0x1) << CRYPTO_RNG_CONTROL_STATUS_PREINT_Pos) /* (CRYPTO_RNG_CONTROL_STATUS) AIS31 preliminary noise alarm interrupt status. Mask */
#define CRYPTO_RNG_CONTROL_STATUS_PREINT(value) (CRYPTO_RNG_CONTROL_STATUS_PREINT_Msk & (_UINT32_(value) << CRYPTO_RNG_CONTROL_STATUS_PREINT_Pos)) /* Assignment of value for PREINT in the CRYPTO_RNG_CONTROL_STATUS register */
#define CRYPTO_RNG_CONTROL_STATUS_ALMINT_Pos  _UINT32_(9)                                          /* (CRYPTO_RNG_CONTROL_STATUS) AIS31 noise alarm interrupt status. Position */
#define CRYPTO_RNG_CONTROL_STATUS_ALMINT_Msk  (_UINT32_(0x1) << CRYPTO_RNG_CONTROL_STATUS_ALMINT_Pos) /* (CRYPTO_RNG_CONTROL_STATUS) AIS31 noise alarm interrupt status. Mask */
#define CRYPTO_RNG_CONTROL_STATUS_ALMINT(value) (CRYPTO_RNG_CONTROL_STATUS_ALMINT_Msk & (_UINT32_(value) << CRYPTO_RNG_CONTROL_STATUS_ALMINT_Pos)) /* Assignment of value for ALMINT in the CRYPTO_RNG_CONTROL_STATUS register */
#define CRYPTO_RNG_CONTROL_STATUS_STARTUPFAIL_Pos _UINT32_(10)                                         /* (CRYPTO_RNG_CONTROL_STATUS) Start-up test failure. Position */
#define CRYPTO_RNG_CONTROL_STATUS_STARTUPFAIL_Msk (_UINT32_(0x1) << CRYPTO_RNG_CONTROL_STATUS_STARTUPFAIL_Pos) /* (CRYPTO_RNG_CONTROL_STATUS) Start-up test failure. Mask */
#define CRYPTO_RNG_CONTROL_STATUS_STARTUPFAIL(value) (CRYPTO_RNG_CONTROL_STATUS_STARTUPFAIL_Msk & (_UINT32_(value) << CRYPTO_RNG_CONTROL_STATUS_STARTUPFAIL_Pos)) /* Assignment of value for STARTUPFAIL in the CRYPTO_RNG_CONTROL_STATUS register */
#define CRYPTO_RNG_CONTROL_STATUS_FIFOACCFAIL_Pos _UINT32_(11)                                         /* (CRYPTO_RNG_CONTROL_STATUS) Set when a FIFO data read is performed while the NDRNG is disabled AND has its FIFO empty (FIFOLevel = 0). Position */
#define CRYPTO_RNG_CONTROL_STATUS_FIFOACCFAIL_Msk (_UINT32_(0x1) << CRYPTO_RNG_CONTROL_STATUS_FIFOACCFAIL_Pos) /* (CRYPTO_RNG_CONTROL_STATUS) Set when a FIFO data read is performed while the NDRNG is disabled AND has its FIFO empty (FIFOLevel = 0). Mask */
#define CRYPTO_RNG_CONTROL_STATUS_FIFOACCFAIL(value) (CRYPTO_RNG_CONTROL_STATUS_FIFOACCFAIL_Msk & (_UINT32_(value) << CRYPTO_RNG_CONTROL_STATUS_FIFOACCFAIL_Pos)) /* Assignment of value for FIFOACCFAIL in the CRYPTO_RNG_CONTROL_STATUS register */
#define CRYPTO_RNG_CONTROL_STATUS_Msk         _UINT32_(0x00000FBF)                                 /* (CRYPTO_RNG_CONTROL_STATUS) Register Mask  */


/* -------- CRYPTO_RNG_CONTROL_INITWAITVAL : (CRYPTO Offset: 0x1034) (R/W 32) Initial wait counter value. -------- */
#define CRYPTO_RNG_CONTROL_INITWAITVAL_RESETVALUE _UINT32_(0xFFFF)                                     /*  (CRYPTO_RNG_CONTROL_INITWAITVAL) Initial wait counter value.  Reset Value */

#define CRYPTO_RNG_CONTROL_INITWAITVAL_INITWAITVAL_Pos _UINT32_(0)                                          /* (CRYPTO_RNG_CONTROL_INITWAITVAL) Number of clock cycles to wait before sampling data from the noise source. Position */
#define CRYPTO_RNG_CONTROL_INITWAITVAL_INITWAITVAL_Msk (_UINT32_(0xFFFF) << CRYPTO_RNG_CONTROL_INITWAITVAL_INITWAITVAL_Pos) /* (CRYPTO_RNG_CONTROL_INITWAITVAL) Number of clock cycles to wait before sampling data from the noise source. Mask */
#define CRYPTO_RNG_CONTROL_INITWAITVAL_INITWAITVAL(value) (CRYPTO_RNG_CONTROL_INITWAITVAL_INITWAITVAL_Msk & (_UINT32_(value) << CRYPTO_RNG_CONTROL_INITWAITVAL_INITWAITVAL_Pos)) /* Assignment of value for INITWAITVAL in the CRYPTO_RNG_CONTROL_INITWAITVAL register */
#define CRYPTO_RNG_CONTROL_INITWAITVAL_Msk    _UINT32_(0x0000FFFF)                                 /* (CRYPTO_RNG_CONTROL_INITWAITVAL) Register Mask  */


/* -------- CRYPTO_RNG_CONTROL_DISABLEOSC0 : (CRYPTO Offset: 0x1038) (R/W 32) Disable oscillator rings #0 to #31. -------- */
#define CRYPTO_RNG_CONTROL_DISABLEOSC0_RESETVALUE _UINT32_(0x00)                                       /*  (CRYPTO_RNG_CONTROL_DISABLEOSC0) Disable oscillator rings #0 to #31.  Reset Value */

