zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/include/component/crypto.h
#define CRYPTO_RNG_CONTROL_DISABLEOSC0_DISABLEOSC0_Pos _UINT32_(0)                                          /* (CRYPTO_RNG_CONTROL_DISABLEOSC0) Disable oscillator rings #0 to #31. Position */
#define CRYPTO_RNG_CONTROL_DISABLEOSC0_DISABLEOSC0_Msk (_UINT32_(0xFFFFFFFF) << CRYPTO_RNG_CONTROL_DISABLEOSC0_DISABLEOSC0_Pos) /* (CRYPTO_RNG_CONTROL_DISABLEOSC0) Disable oscillator rings #0 to #31. Mask */
#define CRYPTO_RNG_CONTROL_DISABLEOSC0_DISABLEOSC0(value) (CRYPTO_RNG_CONTROL_DISABLEOSC0_DISABLEOSC0_Msk & (_UINT32_(value) << CRYPTO_RNG_CONTROL_DISABLEOSC0_DISABLEOSC0_Pos)) /* Assignment of value for DISABLEOSC0 in the CRYPTO_RNG_CONTROL_DISABLEOSC0 register */
#define CRYPTO_RNG_CONTROL_DISABLEOSC0_Msk    _UINT32_(0xFFFFFFFF)                                 /* (CRYPTO_RNG_CONTROL_DISABLEOSC0) Register Mask  */


/* -------- CRYPTO_RNG_CONTROL_DISABLEOSC1 : (CRYPTO Offset: 0x103C) (R/W 32) Disable oscillator rings #32 to #63. -------- */
#define CRYPTO_RNG_CONTROL_DISABLEOSC1_RESETVALUE _UINT32_(0x00)                                       /*  (CRYPTO_RNG_CONTROL_DISABLEOSC1) Disable oscillator rings #32 to #63.  Reset Value */

#define CRYPTO_RNG_CONTROL_DISABLEOSC1_DISABLEOSC1_Pos _UINT32_(0)                                          /* (CRYPTO_RNG_CONTROL_DISABLEOSC1) Disable oscillator rings #32 to #63. Position */
#define CRYPTO_RNG_CONTROL_DISABLEOSC1_DISABLEOSC1_Msk (_UINT32_(0xFFFFFFFF) << CRYPTO_RNG_CONTROL_DISABLEOSC1_DISABLEOSC1_Pos) /* (CRYPTO_RNG_CONTROL_DISABLEOSC1) Disable oscillator rings #32 to #63. Mask */
#define CRYPTO_RNG_CONTROL_DISABLEOSC1_DISABLEOSC1(value) (CRYPTO_RNG_CONTROL_DISABLEOSC1_DISABLEOSC1_Msk & (_UINT32_(value) << CRYPTO_RNG_CONTROL_DISABLEOSC1_DISABLEOSC1_Pos)) /* Assignment of value for DISABLEOSC1 in the CRYPTO_RNG_CONTROL_DISABLEOSC1 register */
#define CRYPTO_RNG_CONTROL_DISABLEOSC1_Msk    _UINT32_(0xFFFFFFFF)                                 /* (CRYPTO_RNG_CONTROL_DISABLEOSC1) Register Mask  */


/* -------- CRYPTO_RNG_CONTROL_SWOFFTMRVAL : (CRYPTO Offset: 0x1040) (R/W 32) Switch off timer value. -------- */
#define CRYPTO_RNG_CONTROL_SWOFFTMRVAL_RESETVALUE _UINT32_(0x00)                                       /*  (CRYPTO_RNG_CONTROL_SWOFFTMRVAL) Switch off timer value.  Reset Value */

#define CRYPTO_RNG_CONTROL_SWOFFTMRVAL_SWOFFTMRVAL_Pos _UINT32_(0)                                          /* (CRYPTO_RNG_CONTROL_SWOFFTMRVAL) Number of clk cycles to wait before stopping the rings after the FIFO is full. Position */
#define CRYPTO_RNG_CONTROL_SWOFFTMRVAL_SWOFFTMRVAL_Msk (_UINT32_(0xFFFF) << CRYPTO_RNG_CONTROL_SWOFFTMRVAL_SWOFFTMRVAL_Pos) /* (CRYPTO_RNG_CONTROL_SWOFFTMRVAL) Number of clk cycles to wait before stopping the rings after the FIFO is full. Mask */
#define CRYPTO_RNG_CONTROL_SWOFFTMRVAL_SWOFFTMRVAL(value) (CRYPTO_RNG_CONTROL_SWOFFTMRVAL_SWOFFTMRVAL_Msk & (_UINT32_(value) << CRYPTO_RNG_CONTROL_SWOFFTMRVAL_SWOFFTMRVAL_Pos)) /* Assignment of value for SWOFFTMRVAL in the CRYPTO_RNG_CONTROL_SWOFFTMRVAL register */
#define CRYPTO_RNG_CONTROL_SWOFFTMRVAL_Msk    _UINT32_(0x0000FFFF)                                 /* (CRYPTO_RNG_CONTROL_SWOFFTMRVAL) Register Mask  */


/* -------- CRYPTO_RNG_CONTROL_CLKDIV : (CRYPTO Offset: 0x1044) (R/W 32) Sample clock divider. -------- */
#define CRYPTO_RNG_CONTROL_CLKDIV_RESETVALUE  _UINT32_(0x00)                                       /*  (CRYPTO_RNG_CONTROL_CLKDIV) Sample clock divider.  Reset Value */

#define CRYPTO_RNG_CONTROL_CLKDIV_CLKDIV_Pos  _UINT32_(0)                                          /* (CRYPTO_RNG_CONTROL_CLKDIV) Sample clock divider. The frequency at which the outputs of the rings are sampled is given by: Fs=Fpclk/(ClkDiv+1). Position */
#define CRYPTO_RNG_CONTROL_CLKDIV_CLKDIV_Msk  (_UINT32_(0xFF) << CRYPTO_RNG_CONTROL_CLKDIV_CLKDIV_Pos) /* (CRYPTO_RNG_CONTROL_CLKDIV) Sample clock divider. The frequency at which the outputs of the rings are sampled is given by: Fs=Fpclk/(ClkDiv+1). Mask */
#define CRYPTO_RNG_CONTROL_CLKDIV_CLKDIV(value) (CRYPTO_RNG_CONTROL_CLKDIV_CLKDIV_Msk & (_UINT32_(value) << CRYPTO_RNG_CONTROL_CLKDIV_CLKDIV_Pos)) /* Assignment of value for CLKDIV in the CRYPTO_RNG_CONTROL_CLKDIV register */
#define CRYPTO_RNG_CONTROL_CLKDIV_Msk         _UINT32_(0x000000FF)                                 /* (CRYPTO_RNG_CONTROL_CLKDIV) Register Mask  */


/* -------- CRYPTO_RNG_CONTROL_AIS31CONF0 : (CRYPTO Offset: 0x1048) (R/W 32) AIS31 configuration register 0. -------- */
#define CRYPTO_RNG_CONTROL_AIS31CONF0_RESETVALUE _UINT32_(0x00)                                       /*  (CRYPTO_RNG_CONTROL_AIS31CONF0) AIS31 configuration register 0.  Reset Value */

#define CRYPTO_RNG_CONTROL_AIS31CONF0_STARTUPTHRESHOLD_Pos _UINT32_(0)                                          /* (CRYPTO_RNG_CONTROL_AIS31CONF0) Start-up test threshold. Position */
#define CRYPTO_RNG_CONTROL_AIS31CONF0_STARTUPTHRESHOLD_Msk (_UINT32_(0xFFFF) << CRYPTO_RNG_CONTROL_AIS31CONF0_STARTUPTHRESHOLD_Pos) /* (CRYPTO_RNG_CONTROL_AIS31CONF0) Start-up test threshold. Mask */
#define CRYPTO_RNG_CONTROL_AIS31CONF0_STARTUPTHRESHOLD(value) (CRYPTO_RNG_CONTROL_AIS31CONF0_STARTUPTHRESHOLD_Msk & (_UINT32_(value) << CRYPTO_RNG_CONTROL_AIS31CONF0_STARTUPTHRESHOLD_Pos)) /* Assignment of value for STARTUPTHRESHOLD in the CRYPTO_RNG_CONTROL_AIS31CONF0 register */
#define CRYPTO_RNG_CONTROL_AIS31CONF0_ONLINETHRESHOLD_Pos _UINT32_(16)                                         /* (CRYPTO_RNG_CONTROL_AIS31CONF0) Online threshold. Position */
#define CRYPTO_RNG_CONTROL_AIS31CONF0_ONLINETHRESHOLD_Msk (_UINT32_(0xFFFF) << CRYPTO_RNG_CONTROL_AIS31CONF0_ONLINETHRESHOLD_Pos) /* (CRYPTO_RNG_CONTROL_AIS31CONF0) Online threshold. Mask */
#define CRYPTO_RNG_CONTROL_AIS31CONF0_ONLINETHRESHOLD(value) (CRYPTO_RNG_CONTROL_AIS31CONF0_ONLINETHRESHOLD_Msk & (_UINT32_(value) << CRYPTO_RNG_CONTROL_AIS31CONF0_ONLINETHRESHOLD_Pos)) /* Assignment of value for ONLINETHRESHOLD in the CRYPTO_RNG_CONTROL_AIS31CONF0 register */
#define CRYPTO_RNG_CONTROL_AIS31CONF0_Msk     _UINT32_(0xFFFFFFFF)                                 /* (CRYPTO_RNG_CONTROL_AIS31CONF0) Register Mask  */


/* -------- CRYPTO_RNG_CONTROL_AIS31CONF1 : (CRYPTO Offset: 0x104C) (R/W 32) AIS31 configuration register 1. -------- */
#define CRYPTO_RNG_CONTROL_AIS31CONF1_RESETVALUE _UINT32_(0x00)                                       /*  (CRYPTO_RNG_CONTROL_AIS31CONF1) AIS31 configuration register 1.  Reset Value */

#define CRYPTO_RNG_CONTROL_AIS31CONF1_ONLINEREPTHRESHOLD_Pos _UINT32_(0)                                          /* (CRYPTO_RNG_CONTROL_AIS31CONF1) Online repeat threshold. Position */
#define CRYPTO_RNG_CONTROL_AIS31CONF1_ONLINEREPTHRESHOLD_Msk (_UINT32_(0xFFFF) << CRYPTO_RNG_CONTROL_AIS31CONF1_ONLINEREPTHRESHOLD_Pos) /* (CRYPTO_RNG_CONTROL_AIS31CONF1) Online repeat threshold. Mask */
#define CRYPTO_RNG_CONTROL_AIS31CONF1_ONLINEREPTHRESHOLD(value) (CRYPTO_RNG_CONTROL_AIS31CONF1_ONLINEREPTHRESHOLD_Msk & (_UINT32_(value) << CRYPTO_RNG_CONTROL_AIS31CONF1_ONLINEREPTHRESHOLD_Pos)) /* Assignment of value for ONLINEREPTHRESHOLD in the CRYPTO_RNG_CONTROL_AIS31CONF1 register */
#define CRYPTO_RNG_CONTROL_AIS31CONF1_HEXPECTEDVALUE_Pos _UINT32_(16)                                         /* (CRYPTO_RNG_CONTROL_AIS31CONF1) Expected history value. Position */
#define CRYPTO_RNG_CONTROL_AIS31CONF1_HEXPECTEDVALUE_Msk (_UINT32_(0xFFFF) << CRYPTO_RNG_CONTROL_AIS31CONF1_HEXPECTEDVALUE_Pos) /* (CRYPTO_RNG_CONTROL_AIS31CONF1) Expected history value. Mask */
#define CRYPTO_RNG_CONTROL_AIS31CONF1_HEXPECTEDVALUE(value) (CRYPTO_RNG_CONTROL_AIS31CONF1_HEXPECTEDVALUE_Msk & (_UINT32_(value) << CRYPTO_RNG_CONTROL_AIS31CONF1_HEXPECTEDVALUE_Pos)) /* Assignment of value for HEXPECTEDVALUE in the CRYPTO_RNG_CONTROL_AIS31CONF1 register */
#define CRYPTO_RNG_CONTROL_AIS31CONF1_Msk     _UINT32_(0xFFFFFFFF)                                 /* (CRYPTO_RNG_CONTROL_AIS31CONF1) Register Mask  */


/* -------- CRYPTO_RNG_CONTROL_AIS31CONF2 : (CRYPTO Offset: 0x1050) (R/W 32) AIS31 configuration register 2. -------- */
#define CRYPTO_RNG_CONTROL_AIS31CONF2_RESETVALUE _UINT32_(0x00)                                       /*  (CRYPTO_RNG_CONTROL_AIS31CONF2) AIS31 configuration register 2.  Reset Value */

#define CRYPTO_RNG_CONTROL_AIS31CONF2_HMIN_Pos _UINT32_(0)                                          /* (CRYPTO_RNG_CONTROL_AIS31CONF2) Minimum allowed history value. Position */
#define CRYPTO_RNG_CONTROL_AIS31CONF2_HMIN_Msk (_UINT32_(0xFFFF) << CRYPTO_RNG_CONTROL_AIS31CONF2_HMIN_Pos) /* (CRYPTO_RNG_CONTROL_AIS31CONF2) Minimum allowed history value. Mask */
#define CRYPTO_RNG_CONTROL_AIS31CONF2_HMIN(value) (CRYPTO_RNG_CONTROL_AIS31CONF2_HMIN_Msk & (_UINT32_(value) << CRYPTO_RNG_CONTROL_AIS31CONF2_HMIN_Pos)) /* Assignment of value for HMIN in the CRYPTO_RNG_CONTROL_AIS31CONF2 register */
#define CRYPTO_RNG_CONTROL_AIS31CONF2_HMAX_Pos _UINT32_(16)                                         /* (CRYPTO_RNG_CONTROL_AIS31CONF2) Maximum allowed history value. Position */
#define CRYPTO_RNG_CONTROL_AIS31CONF2_HMAX_Msk (_UINT32_(0xFFFF) << CRYPTO_RNG_CONTROL_AIS31CONF2_HMAX_Pos) /* (CRYPTO_RNG_CONTROL_AIS31CONF2) Maximum allowed history value. Mask */
#define CRYPTO_RNG_CONTROL_AIS31CONF2_HMAX(value) (CRYPTO_RNG_CONTROL_AIS31CONF2_HMAX_Msk & (_UINT32_(value) << CRYPTO_RNG_CONTROL_AIS31CONF2_HMAX_Pos)) /* Assignment of value for HMAX in the CRYPTO_RNG_CONTROL_AIS31CONF2 register */
#define CRYPTO_RNG_CONTROL_AIS31CONF2_Msk     _UINT32_(0xFFFFFFFF)                                 /* (CRYPTO_RNG_CONTROL_AIS31CONF2) Register Mask  */


