zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/include/component/crypto.h
/* -------- CRYPTO_RNG_CONTROL_AIS31STATUS : (CRYPTO Offset: 0x1054) (R/W 32) AIS31 status register. -------- */
#define CRYPTO_RNG_CONTROL_AIS31STATUS_RESETVALUE _UINT32_(0x00)                                       /*  (CRYPTO_RNG_CONTROL_AIS31STATUS) AIS31 status register.  Reset Value */

#define CRYPTO_RNG_CONTROL_AIS31STATUS_NUMPRELIMALARMS_Pos _UINT32_(0)                                          /* (CRYPTO_RNG_CONTROL_AIS31STATUS) Number of preliminary noise alarms since counter was last cleared. Position */
#define CRYPTO_RNG_CONTROL_AIS31STATUS_NUMPRELIMALARMS_Msk (_UINT32_(0xFFFF) << CRYPTO_RNG_CONTROL_AIS31STATUS_NUMPRELIMALARMS_Pos) /* (CRYPTO_RNG_CONTROL_AIS31STATUS) Number of preliminary noise alarms since counter was last cleared. Mask */
#define CRYPTO_RNG_CONTROL_AIS31STATUS_NUMPRELIMALARMS(value) (CRYPTO_RNG_CONTROL_AIS31STATUS_NUMPRELIMALARMS_Msk & (_UINT32_(value) << CRYPTO_RNG_CONTROL_AIS31STATUS_NUMPRELIMALARMS_Pos)) /* Assignment of value for NUMPRELIMALARMS in the CRYPTO_RNG_CONTROL_AIS31STATUS register */
#define CRYPTO_RNG_CONTROL_AIS31STATUS_PRELIMNOISEALARMRNG_Pos _UINT32_(16)                                         /* (CRYPTO_RNG_CONTROL_AIS31STATUS) Last preliminary noise alarm occurred due to history value out of range. Position */
#define CRYPTO_RNG_CONTROL_AIS31STATUS_PRELIMNOISEALARMRNG_Msk (_UINT32_(0x1) << CRYPTO_RNG_CONTROL_AIS31STATUS_PRELIMNOISEALARMRNG_Pos) /* (CRYPTO_RNG_CONTROL_AIS31STATUS) Last preliminary noise alarm occurred due to history value out of range. Mask */
#define CRYPTO_RNG_CONTROL_AIS31STATUS_PRELIMNOISEALARMRNG(value) (CRYPTO_RNG_CONTROL_AIS31STATUS_PRELIMNOISEALARMRNG_Msk & (_UINT32_(value) << CRYPTO_RNG_CONTROL_AIS31STATUS_PRELIMNOISEALARMRNG_Pos)) /* Assignment of value for PRELIMNOISEALARMRNG in the CRYPTO_RNG_CONTROL_AIS31STATUS register */
#define CRYPTO_RNG_CONTROL_AIS31STATUS_PRELIMNOISEALARMREP_Pos _UINT32_(17)                                         /* (CRYPTO_RNG_CONTROL_AIS31STATUS) Last preliminary noise alarm occurred due to consecutive high X**2. Position */
#define CRYPTO_RNG_CONTROL_AIS31STATUS_PRELIMNOISEALARMREP_Msk (_UINT32_(0x1) << CRYPTO_RNG_CONTROL_AIS31STATUS_PRELIMNOISEALARMREP_Pos) /* (CRYPTO_RNG_CONTROL_AIS31STATUS) Last preliminary noise alarm occurred due to consecutive high X**2. Mask */
#define CRYPTO_RNG_CONTROL_AIS31STATUS_PRELIMNOISEALARMREP(value) (CRYPTO_RNG_CONTROL_AIS31STATUS_PRELIMNOISEALARMREP_Msk & (_UINT32_(value) << CRYPTO_RNG_CONTROL_AIS31STATUS_PRELIMNOISEALARMREP_Pos)) /* Assignment of value for PRELIMNOISEALARMREP in the CRYPTO_RNG_CONTROL_AIS31STATUS register */
#define CRYPTO_RNG_CONTROL_AIS31STATUS_Msk    _UINT32_(0x0003FFFF)                                 /* (CRYPTO_RNG_CONTROL_AIS31STATUS) Register Mask  */


/* -------- CRYPTO_RNG_CONTROL_HWCONFIG : (CRYPTO Offset: 0x1058) ( R/ 32) Hardware configuration register. -------- */
#define CRYPTO_RNG_CONTROL_HWCONFIG_RESETVALUE _UINT32_(0x00)                                       /*  (CRYPTO_RNG_CONTROL_HWCONFIG) Hardware configuration register.  Reset Value */

#define CRYPTO_RNG_CONTROL_HWCONFIG_NUMBOFRINGS_Pos _UINT32_(0)                                          /* (CRYPTO_RNG_CONTROL_HWCONFIG) Generic g_NumRings value. Position */
#define CRYPTO_RNG_CONTROL_HWCONFIG_NUMBOFRINGS_Msk (_UINT32_(0xFF) << CRYPTO_RNG_CONTROL_HWCONFIG_NUMBOFRINGS_Pos) /* (CRYPTO_RNG_CONTROL_HWCONFIG) Generic g_NumRings value. Mask */
#define CRYPTO_RNG_CONTROL_HWCONFIG_NUMBOFRINGS(value) (CRYPTO_RNG_CONTROL_HWCONFIG_NUMBOFRINGS_Msk & (_UINT32_(value) << CRYPTO_RNG_CONTROL_HWCONFIG_NUMBOFRINGS_Pos)) /* Assignment of value for NUMBOFRINGS in the CRYPTO_RNG_CONTROL_HWCONFIG register */
#define CRYPTO_RNG_CONTROL_HWCONFIG_AIS31_Pos _UINT32_(8)                                          /* (CRYPTO_RNG_CONTROL_HWCONFIG) Generic g_AIS31 value. Position */
#define CRYPTO_RNG_CONTROL_HWCONFIG_AIS31_Msk (_UINT32_(0x1) << CRYPTO_RNG_CONTROL_HWCONFIG_AIS31_Pos) /* (CRYPTO_RNG_CONTROL_HWCONFIG) Generic g_AIS31 value. Mask */
#define CRYPTO_RNG_CONTROL_HWCONFIG_AIS31(value) (CRYPTO_RNG_CONTROL_HWCONFIG_AIS31_Msk & (_UINT32_(value) << CRYPTO_RNG_CONTROL_HWCONFIG_AIS31_Pos)) /* Assignment of value for AIS31 in the CRYPTO_RNG_CONTROL_HWCONFIG register */
#define CRYPTO_RNG_CONTROL_HWCONFIG_AIS31Full_Pos _UINT32_(9)                                          /* (CRYPTO_RNG_CONTROL_HWCONFIG) Generic g_AIS31Full value. Position */
#define CRYPTO_RNG_CONTROL_HWCONFIG_AIS31Full_Msk (_UINT32_(0x1) << CRYPTO_RNG_CONTROL_HWCONFIG_AIS31Full_Pos) /* (CRYPTO_RNG_CONTROL_HWCONFIG) Generic g_AIS31Full value. Mask */
#define CRYPTO_RNG_CONTROL_HWCONFIG_AIS31Full(value) (CRYPTO_RNG_CONTROL_HWCONFIG_AIS31Full_Msk & (_UINT32_(value) << CRYPTO_RNG_CONTROL_HWCONFIG_AIS31Full_Pos)) /* Assignment of value for AIS31Full in the CRYPTO_RNG_CONTROL_HWCONFIG register */
#define CRYPTO_RNG_CONTROL_HWCONFIG_Msk       _UINT32_(0x000003FF)                                 /* (CRYPTO_RNG_CONTROL_HWCONFIG) Register Mask  */

#define CRYPTO_RNG_CONTROL_HWCONFIG_AIS_Pos   _UINT32_(8)                                          /* (CRYPTO_RNG_CONTROL_HWCONFIG Position) Generic g_AIS3x value. */
#define CRYPTO_RNG_CONTROL_HWCONFIG_AIS_Msk   (_UINT32_(0x1) << CRYPTO_RNG_CONTROL_HWCONFIG_AIS_Pos) /* (CRYPTO_RNG_CONTROL_HWCONFIG Mask) AIS */
#define CRYPTO_RNG_CONTROL_HWCONFIG_AIS(value) (CRYPTO_RNG_CONTROL_HWCONFIG_AIS_Msk & (_UINT32_(value) << CRYPTO_RNG_CONTROL_HWCONFIG_AIS_Pos)) 

/* -------- CRYPTO_PK_POINTERS : (CRYPTO Offset: 0x2000) (R/W 32) Pointers register. -------- */
#define CRYPTO_PK_POINTERS_RESETVALUE         _UINT32_(0x00)                                       /*  (CRYPTO_PK_POINTERS) Pointers register.  Reset Value */

#define CRYPTO_PK_POINTERS_OPPTRA_Pos         _UINT32_(0)                                          /* (CRYPTO_PK_POINTERS) When executing primitive arithmetic operations, this pointer defines where operand A is located in memory (location 0x0 to 0xF). Position */
#define CRYPTO_PK_POINTERS_OPPTRA_Msk         (_UINT32_(0xF) << CRYPTO_PK_POINTERS_OPPTRA_Pos)     /* (CRYPTO_PK_POINTERS) When executing primitive arithmetic operations, this pointer defines where operand A is located in memory (location 0x0 to 0xF). Mask */
#define CRYPTO_PK_POINTERS_OPPTRA(value)      (CRYPTO_PK_POINTERS_OPPTRA_Msk & (_UINT32_(value) << CRYPTO_PK_POINTERS_OPPTRA_Pos)) /* Assignment of value for OPPTRA in the CRYPTO_PK_POINTERS register */
#define CRYPTO_PK_POINTERS_OPPTRB_Pos         _UINT32_(8)                                          /* (CRYPTO_PK_POINTERS) When executing primitive arithmetic operations, this pointer defines where operand B is located in memory (location 0x0 to 0xF). Position */
#define CRYPTO_PK_POINTERS_OPPTRB_Msk         (_UINT32_(0xF) << CRYPTO_PK_POINTERS_OPPTRB_Pos)     /* (CRYPTO_PK_POINTERS) When executing primitive arithmetic operations, this pointer defines where operand B is located in memory (location 0x0 to 0xF). Mask */
#define CRYPTO_PK_POINTERS_OPPTRB(value)      (CRYPTO_PK_POINTERS_OPPTRB_Msk & (_UINT32_(value) << CRYPTO_PK_POINTERS_OPPTRB_Pos)) /* Assignment of value for OPPTRB in the CRYPTO_PK_POINTERS register */
#define CRYPTO_PK_POINTERS_OPPTRC_Pos         _UINT32_(16)                                         /* (CRYPTO_PK_POINTERS) When executing primitive arithmetic operations, this pointer defines the location (0x0 to 0xF) where the result will be stored in memory. Position */
#define CRYPTO_PK_POINTERS_OPPTRC_Msk         (_UINT32_(0xF) << CRYPTO_PK_POINTERS_OPPTRC_Pos)     /* (CRYPTO_PK_POINTERS) When executing primitive arithmetic operations, this pointer defines the location (0x0 to 0xF) where the result will be stored in memory. Mask */
#define CRYPTO_PK_POINTERS_OPPTRC(value)      (CRYPTO_PK_POINTERS_OPPTRC_Msk & (_UINT32_(value) << CRYPTO_PK_POINTERS_OPPTRC_Pos)) /* Assignment of value for OPPTRC in the CRYPTO_PK_POINTERS register */
#define CRYPTO_PK_POINTERS_OPPTRN_Pos         _UINT32_(24)                                         /* (CRYPTO_PK_POINTERS) When executing primitive arithmetic operations, this pointer defines the location where the modulus is located in memory (location 0x0 to 0xF). Position */
#define CRYPTO_PK_POINTERS_OPPTRN_Msk         (_UINT32_(0xF) << CRYPTO_PK_POINTERS_OPPTRN_Pos)     /* (CRYPTO_PK_POINTERS) When executing primitive arithmetic operations, this pointer defines the location where the modulus is located in memory (location 0x0 to 0xF). Mask */
#define CRYPTO_PK_POINTERS_OPPTRN(value)      (CRYPTO_PK_POINTERS_OPPTRN_Msk & (_UINT32_(value) << CRYPTO_PK_POINTERS_OPPTRN_Pos)) /* Assignment of value for OPPTRN in the CRYPTO_PK_POINTERS register */
#define CRYPTO_PK_POINTERS_Msk                _UINT32_(0x0F0F0F0F)                                 /* (CRYPTO_PK_POINTERS) Register Mask  */


/* -------- CRYPTO_PK_COMMAND : (CRYPTO Offset: 0x2004) (R/W 32) Command register. -------- */
#define CRYPTO_PK_COMMAND_RESETVALUE          _UINT32_(0x0F)                                       /*  (CRYPTO_PK_COMMAND) Command register.  Reset Value */

#define CRYPTO_PK_COMMAND_OPEADDR_Pos         _UINT32_(0)                                          /* (CRYPTO_PK_COMMAND) This field defines the operation to be performed. See documentation for more details. Position */
#define CRYPTO_PK_COMMAND_OPEADDR_Msk         (_UINT32_(0x7F) << CRYPTO_PK_COMMAND_OPEADDR_Pos)    /* (CRYPTO_PK_COMMAND) This field defines the operation to be performed. See documentation for more details. Mask */
#define CRYPTO_PK_COMMAND_OPEADDR(value)      (CRYPTO_PK_COMMAND_OPEADDR_Msk & (_UINT32_(value) << CRYPTO_PK_COMMAND_OPEADDR_Pos)) /* Assignment of value for OPEADDR in the CRYPTO_PK_COMMAND register */
#define CRYPTO_PK_COMMAND_FIELDF_Pos          _UINT32_(7)                                          /* (CRYPTO_PK_COMMAND) '0': Field is GF(p) '1': Field is GF(2**m) Position */
#define CRYPTO_PK_COMMAND_FIELDF_Msk          (_UINT32_(0x1) << CRYPTO_PK_COMMAND_FIELDF_Pos)      /* (CRYPTO_PK_COMMAND) '0': Field is GF(p) '1': Field is GF(2**m) Mask */
#define CRYPTO_PK_COMMAND_FIELDF(value)       (CRYPTO_PK_COMMAND_FIELDF_Msk & (_UINT32_(value) << CRYPTO_PK_COMMAND_FIELDF_Pos)) /* Assignment of value for FIELDF in the CRYPTO_PK_COMMAND register */
#define CRYPTO_PK_COMMAND_OPBYTESM1_Pos       _UINT32_(8)                                          /* (CRYPTO_PK_COMMAND) This field defines the size (= number of bytes minus one) of the operands for the current operation. Possible values are limited by the maximum supported operand size. Examples: - 0x014 -> ECC on curve K-163 - 0x01F -> ECC on curve P-256 - 0x02F -> ECC on curve P-384 - 0x033 -> ECC on curve K-409 - 0x041 -> ECC on curve P-521 - 0x07F -> 1024-bit RSA - 0x09F -> 1280-bit RSA - 0x1FF -> 4096-bit RSA - 0x3FF -> 8192-bit RSA Position */
#define CRYPTO_PK_COMMAND_OPBYTESM1_Msk       (_UINT32_(0x3FF) << CRYPTO_PK_COMMAND_OPBYTESM1_Pos) /* (CRYPTO_PK_COMMAND) This field defines the size (= number of bytes minus one) of the operands for the current operation. Possible values are limited by the maximum supported operand size. Examples: - 0x014 -> ECC on curve K-163 - 0x01F -> ECC on curve P-256 - 0x02F -> ECC on curve P-384 - 0x033 -> ECC on curve K-409 - 0x041 -> ECC on curve P-521 - 0x07F -> 1024-bit RSA - 0x09F -> 1280-bit RSA - 0x1FF -> 4096-bit RSA - 0x3FF -> 8192-bit RSA Mask */
#define CRYPTO_PK_COMMAND_OPBYTESM1(value)    (CRYPTO_PK_COMMAND_OPBYTESM1_Msk & (_UINT32_(value) << CRYPTO_PK_COMMAND_OPBYTESM1_Pos)) /* Assignment of value for OPBYTESM1 in the CRYPTO_PK_COMMAND register */
#define CRYPTO_PK_COMMAND_RANDMOD_Pos         _UINT32_(19)                                         /* (CRYPTO_PK_COMMAND) Enable randomization of modulus (counter-measure). Position */
#define CRYPTO_PK_COMMAND_RANDMOD_Msk         (_UINT32_(0x1) << CRYPTO_PK_COMMAND_RANDMOD_Pos)     /* (CRYPTO_PK_COMMAND) Enable randomization of modulus (counter-measure). Mask */
#define CRYPTO_PK_COMMAND_RANDMOD(value)      (CRYPTO_PK_COMMAND_RANDMOD_Msk & (_UINT32_(value) << CRYPTO_PK_COMMAND_RANDMOD_Pos)) /* Assignment of value for RANDMOD in the CRYPTO_PK_COMMAND register */
#define CRYPTO_PK_COMMAND_SELCURVE_Pos        _UINT32_(20)                                         /* (CRYPTO_PK_COMMAND) Enable accelerator for specific curve modulus: 0x0: No acceleration (default) 0x1: P256 0x2: P384 0x3: P521 0x4: P192 0x5: Curve25519 0x6: Ed25519 This field has no effect when the optional acceleration hardware is not included. Position */
#define CRYPTO_PK_COMMAND_SELCURVE_Msk        (_UINT32_(0x7) << CRYPTO_PK_COMMAND_SELCURVE_Pos)    /* (CRYPTO_PK_COMMAND) Enable accelerator for specific curve modulus: 0x0: No acceleration (default) 0x1: P256 0x2: P384 0x3: P521 0x4: P192 0x5: Curve25519 0x6: Ed25519 This field has no effect when the optional acceleration hardware is not included. Mask */
#define CRYPTO_PK_COMMAND_SELCURVE(value)     (CRYPTO_PK_COMMAND_SELCURVE_Msk & (_UINT32_(value) << CRYPTO_PK_COMMAND_SELCURVE_Pos)) /* Assignment of value for SELCURVE in the CRYPTO_PK_COMMAND register */
#define CRYPTO_PK_COMMAND_RANDKE_Pos          _UINT32_(24)                                         /* (CRYPTO_PK_COMMAND) Enable randomization of exponent/scalar (counter-measure). Position */
#define CRYPTO_PK_COMMAND_RANDKE_Msk          (_UINT32_(0x1) << CRYPTO_PK_COMMAND_RANDKE_Pos)      /* (CRYPTO_PK_COMMAND) Enable randomization of exponent/scalar (counter-measure). Mask */
#define CRYPTO_PK_COMMAND_RANDKE(value)       (CRYPTO_PK_COMMAND_RANDKE_Msk & (_UINT32_(value) << CRYPTO_PK_COMMAND_RANDKE_Pos)) /* Assignment of value for RANDKE in the CRYPTO_PK_COMMAND register */
#define CRYPTO_PK_COMMAND_RANDPROJ_Pos        _UINT32_(25)                                         /* (CRYPTO_PK_COMMAND) Enable randomization of projective coordinates (counter-measure). Position */
#define CRYPTO_PK_COMMAND_RANDPROJ_Msk        (_UINT32_(0x1) << CRYPTO_PK_COMMAND_RANDPROJ_Pos)    /* (CRYPTO_PK_COMMAND) Enable randomization of projective coordinates (counter-measure). Mask */
#define CRYPTO_PK_COMMAND_RANDPROJ(value)     (CRYPTO_PK_COMMAND_RANDPROJ_Msk & (_UINT32_(value) << CRYPTO_PK_COMMAND_RANDPROJ_Pos)) /* Assignment of value for RANDPROJ in the CRYPTO_PK_COMMAND register */
#define CRYPTO_PK_COMMAND_EDWARDS_Pos         _UINT32_(26)                                         /* (CRYPTO_PK_COMMAND) Enable Edwards curve (see operation description). Position */
#define CRYPTO_PK_COMMAND_EDWARDS_Msk         (_UINT32_(0x1) << CRYPTO_PK_COMMAND_EDWARDS_Pos)     /* (CRYPTO_PK_COMMAND) Enable Edwards curve (see operation description). Mask */
#define CRYPTO_PK_COMMAND_EDWARDS(value)      (CRYPTO_PK_COMMAND_EDWARDS_Msk & (_UINT32_(value) << CRYPTO_PK_COMMAND_EDWARDS_Pos)) /* Assignment of value for EDWARDS in the CRYPTO_PK_COMMAND register */
#define CRYPTO_PK_COMMAND_SWAPBYTES_Pos       _UINT32_(28)                                         /* (CRYPTO_PK_COMMAND) Swap the bytes on AHB interface: '0': Native format (little endian) '1': Byte swapped (big endian) See also section 4.2.1. This bit must be programmed before writing/reading any data in data memory. Position */
#define CRYPTO_PK_COMMAND_SWAPBYTES_Msk       (_UINT32_(0x1) << CRYPTO_PK_COMMAND_SWAPBYTES_Pos)   /* (CRYPTO_PK_COMMAND) Swap the bytes on AHB interface: '0': Native format (little endian) '1': Byte swapped (big endian) See also section 4.2.1. This bit must be programmed before writing/reading any data in data memory. Mask */
#define CRYPTO_PK_COMMAND_SWAPBYTES(value)    (CRYPTO_PK_COMMAND_SWAPBYTES_Msk & (_UINT32_(value) << CRYPTO_PK_COMMAND_SWAPBYTES_Pos)) /* Assignment of value for SWAPBYTES in the CRYPTO_PK_COMMAND register */
#define CRYPTO_PK_COMMAND_FLAGA_Pos           _UINT32_(29)                                         /* (CRYPTO_PK_COMMAND) See operation description. Position */
#define CRYPTO_PK_COMMAND_FLAGA_Msk           (_UINT32_(0x1) << CRYPTO_PK_COMMAND_FLAGA_Pos)       /* (CRYPTO_PK_COMMAND) See operation description. Mask */
#define CRYPTO_PK_COMMAND_FLAGA(value)        (CRYPTO_PK_COMMAND_FLAGA_Msk & (_UINT32_(value) << CRYPTO_PK_COMMAND_FLAGA_Pos)) /* Assignment of value for FLAGA in the CRYPTO_PK_COMMAND register */
#define CRYPTO_PK_COMMAND_FLAGB_Pos           _UINT32_(30)                                         /* (CRYPTO_PK_COMMAND) See operation description. Position */
#define CRYPTO_PK_COMMAND_FLAGB_Msk           (_UINT32_(0x1) << CRYPTO_PK_COMMAND_FLAGB_Pos)       /* (CRYPTO_PK_COMMAND) See operation description. Mask */
#define CRYPTO_PK_COMMAND_FLAGB(value)        (CRYPTO_PK_COMMAND_FLAGB_Msk & (_UINT32_(value) << CRYPTO_PK_COMMAND_FLAGB_Pos)) /* Assignment of value for FLAGB in the CRYPTO_PK_COMMAND register */
#define CRYPTO_PK_COMMAND_CALCR2_Pos          _UINT32_(31)                                         /* (CRYPTO_PK_COMMAND) This bit indicates if the IP has to calculate R**2 mod N for the next operation. This bit must be set to '1' when a new prime number has been programmed. This bit is used for primitive operations and ignored for the other operations. '0': don't recalculate R**2 mod N '1': re-calculate R**2 mod N Position */
#define CRYPTO_PK_COMMAND_CALCR2_Msk          (_UINT32_(0x1) << CRYPTO_PK_COMMAND_CALCR2_Pos)      /* (CRYPTO_PK_COMMAND) This bit indicates if the IP has to calculate R**2 mod N for the next operation. This bit must be set to '1' when a new prime number has been programmed. This bit is used for primitive operations and ignored for the other operations. '0': don't recalculate R**2 mod N '1': re-calculate R**2 mod N Mask */
#define CRYPTO_PK_COMMAND_CALCR2(value)       (CRYPTO_PK_COMMAND_CALCR2_Msk & (_UINT32_(value) << CRYPTO_PK_COMMAND_CALCR2_Pos)) /* Assignment of value for CALCR2 in the CRYPTO_PK_COMMAND register */
#define CRYPTO_PK_COMMAND_Msk                 _UINT32_(0xF77BFFFF)                                 /* (CRYPTO_PK_COMMAND) Register Mask  */

#define CRYPTO_PK_COMMAND_CALCR_Pos           _UINT32_(31)                                         /* (CRYPTO_PK_COMMAND Position) This bit indicates if the IP has to calculate R**2 mod N for the next operation. This bit must be set to 'x' when a new prime number has been programmed. This bit is used for primitive operations and ignored for the other operations. 'x': don't recalculate R**2 mod N 'x': re-calculate R**2 mod N */
#define CRYPTO_PK_COMMAND_CALCR_Msk           (_UINT32_(0x1) << CRYPTO_PK_COMMAND_CALCR_Pos)       /* (CRYPTO_PK_COMMAND Mask) CALCR */
#define CRYPTO_PK_COMMAND_CALCR(value)        (CRYPTO_PK_COMMAND_CALCR_Msk & (_UINT32_(value) << CRYPTO_PK_COMMAND_CALCR_Pos)) 

/* -------- CRYPTO_PK_CONTROL : (CRYPTO Offset: 0x2008) ( /W 32) Command register. -------- */
#define CRYPTO_PK_CONTROL_RESETVALUE          _UINT32_(0x00)                                       /*  (CRYPTO_PK_CONTROL) Command register.  Reset Value */

