zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/include/component/crypto.h
#define CRYPTO_PK_CONTROL_START_Pos           _UINT32_(0)                                          /* (CRYPTO_PK_CONTROL) Writing a '1' starts the processing. Position */
#define CRYPTO_PK_CONTROL_START_Msk           (_UINT32_(0x1) << CRYPTO_PK_CONTROL_START_Pos)       /* (CRYPTO_PK_CONTROL) Writing a '1' starts the processing. Mask */
#define CRYPTO_PK_CONTROL_START(value)        (CRYPTO_PK_CONTROL_START_Msk & (_UINT32_(value) << CRYPTO_PK_CONTROL_START_Pos)) /* Assignment of value for START in the CRYPTO_PK_CONTROL register */
#define CRYPTO_PK_CONTROL_CLEARIRQ_Pos        _UINT32_(1)                                          /* (CRYPTO_PK_CONTROL) Writing a '1' clears the IRQ output. Position */
#define CRYPTO_PK_CONTROL_CLEARIRQ_Msk        (_UINT32_(0x1) << CRYPTO_PK_CONTROL_CLEARIRQ_Pos)    /* (CRYPTO_PK_CONTROL) Writing a '1' clears the IRQ output. Mask */
#define CRYPTO_PK_CONTROL_CLEARIRQ(value)     (CRYPTO_PK_CONTROL_CLEARIRQ_Msk & (_UINT32_(value) << CRYPTO_PK_CONTROL_CLEARIRQ_Pos)) /* Assignment of value for CLEARIRQ in the CRYPTO_PK_CONTROL register */
#define CRYPTO_PK_CONTROL_Msk                 _UINT32_(0x00000003)                                 /* (CRYPTO_PK_CONTROL) Register Mask  */


/* -------- CRYPTO_PK_STATUS : (CRYPTO Offset: 0x200C) ( R/ 32) Status register. -------- */
#define CRYPTO_PK_STATUS_RESETVALUE           _UINT32_(0x00)                                       /*  (CRYPTO_PK_STATUS) Status register.  Reset Value */

#define CRYPTO_PK_STATUS_ERRORFLAGS_Pos       _UINT32_(4)                                          /* (CRYPTO_PK_STATUS) These bits indicate an error condition. They are updated at the end of the operation. They are cleared when starting a new operation. See documentation for more details. Position */
#define CRYPTO_PK_STATUS_ERRORFLAGS_Msk       (_UINT32_(0xFFF) << CRYPTO_PK_STATUS_ERRORFLAGS_Pos) /* (CRYPTO_PK_STATUS) These bits indicate an error condition. They are updated at the end of the operation. They are cleared when starting a new operation. See documentation for more details. Mask */
#define CRYPTO_PK_STATUS_ERRORFLAGS(value)    (CRYPTO_PK_STATUS_ERRORFLAGS_Msk & (_UINT32_(value) << CRYPTO_PK_STATUS_ERRORFLAGS_Pos)) /* Assignment of value for ERRORFLAGS in the CRYPTO_PK_STATUS register */
#define CRYPTO_PK_STATUS_PK_BUSY_Pos          _UINT32_(16)                                         /* (CRYPTO_PK_STATUS) This bit reflects the BUSY output value. It is set when the operation starts and it is cleared when the operation is finished. Position */
#define CRYPTO_PK_STATUS_PK_BUSY_Msk          (_UINT32_(0x1) << CRYPTO_PK_STATUS_PK_BUSY_Pos)      /* (CRYPTO_PK_STATUS) This bit reflects the BUSY output value. It is set when the operation starts and it is cleared when the operation is finished. Mask */
#define CRYPTO_PK_STATUS_PK_BUSY(value)       (CRYPTO_PK_STATUS_PK_BUSY_Msk & (_UINT32_(value) << CRYPTO_PK_STATUS_PK_BUSY_Pos)) /* Assignment of value for PK_BUSY in the CRYPTO_PK_STATUS register */
#define CRYPTO_PK_STATUS_INTRPTSTATUS_Pos     _UINT32_(17)                                         /* (CRYPTO_PK_STATUS) This bit reflects the IRQ output value. It is set when the operation is finished. It is cleared when the CPU writes the bit 1 of Control Register. Position */
#define CRYPTO_PK_STATUS_INTRPTSTATUS_Msk     (_UINT32_(0x1) << CRYPTO_PK_STATUS_INTRPTSTATUS_Pos) /* (CRYPTO_PK_STATUS) This bit reflects the IRQ output value. It is set when the operation is finished. It is cleared when the CPU writes the bit 1 of Control Register. Mask */
#define CRYPTO_PK_STATUS_INTRPTSTATUS(value)  (CRYPTO_PK_STATUS_INTRPTSTATUS_Msk & (_UINT32_(value) << CRYPTO_PK_STATUS_INTRPTSTATUS_Pos)) /* Assignment of value for INTRPTSTATUS in the CRYPTO_PK_STATUS register */
#define CRYPTO_PK_STATUS_FAILPTR_Pos          _UINT32_(24)                                         /* (CRYPTO_PK_STATUS) These bits indicate which data location generated the error flag. They are not available for all error flags. Position */
#define CRYPTO_PK_STATUS_FAILPTR_Msk          (_UINT32_(0x1F) << CRYPTO_PK_STATUS_FAILPTR_Pos)     /* (CRYPTO_PK_STATUS) These bits indicate which data location generated the error flag. They are not available for all error flags. Mask */
#define CRYPTO_PK_STATUS_FAILPTR(value)       (CRYPTO_PK_STATUS_FAILPTR_Msk & (_UINT32_(value) << CRYPTO_PK_STATUS_FAILPTR_Pos)) /* Assignment of value for FAILPTR in the CRYPTO_PK_STATUS register */
#define CRYPTO_PK_STATUS_Msk                  _UINT32_(0x1F03FFF0)                                 /* (CRYPTO_PK_STATUS) Register Mask  */


/* -------- CRYPTO_PK_TIMER : (CRYPTO Offset: 0x2014) (R/W 32) Timer register. -------- */
#define CRYPTO_PK_TIMER_RESETVALUE            _UINT32_(0x00)                                       /*  (CRYPTO_PK_TIMER) Timer register.  Reset Value */

#define CRYPTO_PK_TIMER_TIMER_Pos             _UINT32_(0)                                          /* (CRYPTO_PK_TIMER) Number of core clock cycles. Position */
#define CRYPTO_PK_TIMER_TIMER_Msk             (_UINT32_(0xFFFFFFFF) << CRYPTO_PK_TIMER_TIMER_Pos)  /* (CRYPTO_PK_TIMER) Number of core clock cycles. Mask */
#define CRYPTO_PK_TIMER_TIMER(value)          (CRYPTO_PK_TIMER_TIMER_Msk & (_UINT32_(value) << CRYPTO_PK_TIMER_TIMER_Pos)) /* Assignment of value for TIMER in the CRYPTO_PK_TIMER register */
#define CRYPTO_PK_TIMER_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (CRYPTO_PK_TIMER) Register Mask  */


/* -------- CRYPTO_PK_HWCONFIG : (CRYPTO Offset: 0x2018) ( R/ 32) Hardware configuration register. -------- */
#define CRYPTO_PK_HWCONFIG_RESETVALUE         _UINT32_(0x00)                                       /*  (CRYPTO_PK_HWCONFIG) Hardware configuration register.  Reset Value */

#define CRYPTO_PK_HWCONFIG_MAXOPSIZE_Pos      _UINT32_(0)                                          /* (CRYPTO_PK_HWCONFIG) Maximum operand size (number of bytes). Position */
#define CRYPTO_PK_HWCONFIG_MAXOPSIZE_Msk      (_UINT32_(0xFFF) << CRYPTO_PK_HWCONFIG_MAXOPSIZE_Pos) /* (CRYPTO_PK_HWCONFIG) Maximum operand size (number of bytes). Mask */
#define CRYPTO_PK_HWCONFIG_MAXOPSIZE(value)   (CRYPTO_PK_HWCONFIG_MAXOPSIZE_Msk & (_UINT32_(value) << CRYPTO_PK_HWCONFIG_MAXOPSIZE_Pos)) /* Assignment of value for MAXOPSIZE in the CRYPTO_PK_HWCONFIG register */
#define CRYPTO_PK_HWCONFIG_NBMULT_Pos         _UINT32_(12)                                         /* (CRYPTO_PK_HWCONFIG) Number of multipliers: 0x0: 1 multiplier 0x1: 4 multipliers 0x2: 16 multipliers 0x4: 64 multipliers 0x8: 256 multipliers Position */
#define CRYPTO_PK_HWCONFIG_NBMULT_Msk         (_UINT32_(0xF) << CRYPTO_PK_HWCONFIG_NBMULT_Pos)     /* (CRYPTO_PK_HWCONFIG) Number of multipliers: 0x0: 1 multiplier 0x1: 4 multipliers 0x2: 16 multipliers 0x4: 64 multipliers 0x8: 256 multipliers Mask */
#define CRYPTO_PK_HWCONFIG_NBMULT(value)      (CRYPTO_PK_HWCONFIG_NBMULT_Msk & (_UINT32_(value) << CRYPTO_PK_HWCONFIG_NBMULT_Pos)) /* Assignment of value for NBMULT in the CRYPTO_PK_HWCONFIG register */
#define CRYPTO_PK_HWCONFIG_PRIMEFIELD_Pos     _UINT32_(16)                                         /* (CRYPTO_PK_HWCONFIG) Support prime field. Position */
#define CRYPTO_PK_HWCONFIG_PRIMEFIELD_Msk     (_UINT32_(0x1) << CRYPTO_PK_HWCONFIG_PRIMEFIELD_Pos) /* (CRYPTO_PK_HWCONFIG) Support prime field. Mask */
#define CRYPTO_PK_HWCONFIG_PRIMEFIELD(value)  (CRYPTO_PK_HWCONFIG_PRIMEFIELD_Msk & (_UINT32_(value) << CRYPTO_PK_HWCONFIG_PRIMEFIELD_Pos)) /* Assignment of value for PRIMEFIELD in the CRYPTO_PK_HWCONFIG register */
#define CRYPTO_PK_HWCONFIG_BINARYFIELD_Pos    _UINT32_(17)                                         /* (CRYPTO_PK_HWCONFIG) Support binary field. Position */
#define CRYPTO_PK_HWCONFIG_BINARYFIELD_Msk    (_UINT32_(0x1) << CRYPTO_PK_HWCONFIG_BINARYFIELD_Pos) /* (CRYPTO_PK_HWCONFIG) Support binary field. Mask */
#define CRYPTO_PK_HWCONFIG_BINARYFIELD(value) (CRYPTO_PK_HWCONFIG_BINARYFIELD_Msk & (_UINT32_(value) << CRYPTO_PK_HWCONFIG_BINARYFIELD_Pos)) /* Assignment of value for BINARYFIELD in the CRYPTO_PK_HWCONFIG register */
#define CRYPTO_PK_HWCONFIG_P256_Pos           _UINT32_(20)                                         /* (CRYPTO_PK_HWCONFIG) Support ECC P256 acceleration. Position */
#define CRYPTO_PK_HWCONFIG_P256_Msk           (_UINT32_(0x1) << CRYPTO_PK_HWCONFIG_P256_Pos)       /* (CRYPTO_PK_HWCONFIG) Support ECC P256 acceleration. Mask */
#define CRYPTO_PK_HWCONFIG_P256(value)        (CRYPTO_PK_HWCONFIG_P256_Msk & (_UINT32_(value) << CRYPTO_PK_HWCONFIG_P256_Pos)) /* Assignment of value for P256 in the CRYPTO_PK_HWCONFIG register */
#define CRYPTO_PK_HWCONFIG_P384_Pos           _UINT32_(21)                                         /* (CRYPTO_PK_HWCONFIG) Support ECC P384 acceleration. Position */
#define CRYPTO_PK_HWCONFIG_P384_Msk           (_UINT32_(0x1) << CRYPTO_PK_HWCONFIG_P384_Pos)       /* (CRYPTO_PK_HWCONFIG) Support ECC P384 acceleration. Mask */
#define CRYPTO_PK_HWCONFIG_P384(value)        (CRYPTO_PK_HWCONFIG_P384_Msk & (_UINT32_(value) << CRYPTO_PK_HWCONFIG_P384_Pos)) /* Assignment of value for P384 in the CRYPTO_PK_HWCONFIG register */
#define CRYPTO_PK_HWCONFIG_P521_Pos           _UINT32_(22)                                         /* (CRYPTO_PK_HWCONFIG) Support ECC P521 acceleration. Position */
#define CRYPTO_PK_HWCONFIG_P521_Msk           (_UINT32_(0x1) << CRYPTO_PK_HWCONFIG_P521_Pos)       /* (CRYPTO_PK_HWCONFIG) Support ECC P521 acceleration. Mask */
#define CRYPTO_PK_HWCONFIG_P521(value)        (CRYPTO_PK_HWCONFIG_P521_Msk & (_UINT32_(value) << CRYPTO_PK_HWCONFIG_P521_Pos)) /* Assignment of value for P521 in the CRYPTO_PK_HWCONFIG register */
#define CRYPTO_PK_HWCONFIG_P192_Pos           _UINT32_(23)                                         /* (CRYPTO_PK_HWCONFIG) Support ECC P192 acceleration. Position */
#define CRYPTO_PK_HWCONFIG_P192_Msk           (_UINT32_(0x1) << CRYPTO_PK_HWCONFIG_P192_Pos)       /* (CRYPTO_PK_HWCONFIG) Support ECC P192 acceleration. Mask */
#define CRYPTO_PK_HWCONFIG_P192(value)        (CRYPTO_PK_HWCONFIG_P192_Msk & (_UINT32_(value) << CRYPTO_PK_HWCONFIG_P192_Pos)) /* Assignment of value for P192 in the CRYPTO_PK_HWCONFIG register */
#define CRYPTO_PK_HWCONFIG_X25519_Pos         _UINT32_(24)                                         /* (CRYPTO_PK_HWCONFIG) Support Curve25519/Ed25519 acceleration. Position */
#define CRYPTO_PK_HWCONFIG_X25519_Msk         (_UINT32_(0x1) << CRYPTO_PK_HWCONFIG_X25519_Pos)     /* (CRYPTO_PK_HWCONFIG) Support Curve25519/Ed25519 acceleration. Mask */
#define CRYPTO_PK_HWCONFIG_X25519(value)      (CRYPTO_PK_HWCONFIG_X25519_Msk & (_UINT32_(value) << CRYPTO_PK_HWCONFIG_X25519_Pos)) /* Assignment of value for X25519 in the CRYPTO_PK_HWCONFIG register */
#define CRYPTO_PK_HWCONFIG_AHBMASTER_Pos      _UINT32_(25)                                         /* (CRYPTO_PK_HWCONFIG) '0': Memory access through AHB Slave and internally in the PKE.                                                                             '1': Memory access through AHB Master, outside the PKE. Position */
#define CRYPTO_PK_HWCONFIG_AHBMASTER_Msk      (_UINT32_(0x1) << CRYPTO_PK_HWCONFIG_AHBMASTER_Pos)  /* (CRYPTO_PK_HWCONFIG) '0': Memory access through AHB Slave and internally in the PKE.                                                                             '1': Memory access through AHB Master, outside the PKE. Mask */
#define CRYPTO_PK_HWCONFIG_AHBMASTER(value)   (CRYPTO_PK_HWCONFIG_AHBMASTER_Msk & (_UINT32_(value) << CRYPTO_PK_HWCONFIG_AHBMASTER_Pos)) /* Assignment of value for AHBMASTER in the CRYPTO_PK_HWCONFIG register */
#define CRYPTO_PK_HWCONFIG_DISABLESMX_Pos     _UINT32_(29)                                         /* (CRYPTO_PK_HWCONFIG) State of DisableSMx input (high when SM2/SM9 operations are disabled). Position */
#define CRYPTO_PK_HWCONFIG_DISABLESMX_Msk     (_UINT32_(0x1) << CRYPTO_PK_HWCONFIG_DISABLESMX_Pos) /* (CRYPTO_PK_HWCONFIG) State of DisableSMx input (high when SM2/SM9 operations are disabled). Mask */
#define CRYPTO_PK_HWCONFIG_DISABLESMX(value)  (CRYPTO_PK_HWCONFIG_DISABLESMX_Msk & (_UINT32_(value) << CRYPTO_PK_HWCONFIG_DISABLESMX_Pos)) /* Assignment of value for DISABLESMX in the CRYPTO_PK_HWCONFIG register */
#define CRYPTO_PK_HWCONFIG_DISABLECLRMEM_Pos  _UINT32_(30)                                         /* (CRYPTO_PK_HWCONFIG) State of DisableClrMem input (high when automatic clear of the RAM after reset is disabled). Position */
#define CRYPTO_PK_HWCONFIG_DISABLECLRMEM_Msk  (_UINT32_(0x1) << CRYPTO_PK_HWCONFIG_DISABLECLRMEM_Pos) /* (CRYPTO_PK_HWCONFIG) State of DisableClrMem input (high when automatic clear of the RAM after reset is disabled). Mask */
#define CRYPTO_PK_HWCONFIG_DISABLECLRMEM(value) (CRYPTO_PK_HWCONFIG_DISABLECLRMEM_Msk & (_UINT32_(value) << CRYPTO_PK_HWCONFIG_DISABLECLRMEM_Pos)) /* Assignment of value for DISABLECLRMEM in the CRYPTO_PK_HWCONFIG register */
#define CRYPTO_PK_HWCONFIG_DISABLECM_Pos      _UINT32_(31)                                         /* (CRYPTO_PK_HWCONFIG) State of DisableCM input (high when counter-measures are disabled). Position */
#define CRYPTO_PK_HWCONFIG_DISABLECM_Msk      (_UINT32_(0x1) << CRYPTO_PK_HWCONFIG_DISABLECM_Pos)  /* (CRYPTO_PK_HWCONFIG) State of DisableCM input (high when counter-measures are disabled). Mask */
#define CRYPTO_PK_HWCONFIG_DISABLECM(value)   (CRYPTO_PK_HWCONFIG_DISABLECM_Msk & (_UINT32_(value) << CRYPTO_PK_HWCONFIG_DISABLECM_Pos)) /* Assignment of value for DISABLECM in the CRYPTO_PK_HWCONFIG register */
#define CRYPTO_PK_HWCONFIG_Msk                _UINT32_(0xE3F3FFFF)                                 /* (CRYPTO_PK_HWCONFIG) Register Mask  */

